src/usr.bin/midiplay/midiplay.1
.\" $MirOS: src/usr.bin/midiplay/midiplay.1,v 1.2 2005/03/13 18:33:17 tg Exp $
.\" $OpenBSD: midiplay.1,v 1.9 2005/03/11 22:54:06 jmc Exp $
.\" $NetBSD: midiplay.1,v 1.3 1998/08/13 18:26:36 augustss Exp $
.\"
.\" Copyright (c) 1998 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" Author: Lennart Augustsson
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd August 12, 1998
.Dt MIDIPLAY 1
.Os
.Sh NAME
.Nm midiplay
.Nd play MIDI and RMID files
.Sh SYNOPSIS
.Nm midiplay
.Op Fl lmqvx
.Op Fl d Ar devno
.Op Fl f Ar file
.Op Fl t Ar tempo
.Op Ar file ...
.Sh DESCRIPTION
The
.Nm
command plays MIDI and RMID files using the sequencer device.
.Pp
RMID files are Standard MIDI Files embedded in a RIFF container and
can usually be found with the 'rmi' extension.
They contain some additional information in other chunks which are
not parsed by
.Nm
yet.
RIFF containers can contain more than one chunk of data; however, using
.Nm
on these is not supported and will behave unpredictably.
.Pp
If no file name is given it will play from standard input;
otherwise it will play the named files.
.Pp
The options are as follows:
.Bl -tag -width "-d devnoXX"
.It Fl d Ar devno
Specifies the number of the MIDI device used for output (as listed
by the
.Fl l
flag).
The default is device 0.
.It Fl f Ar file
Specifies the name of the sequencer device.
.It Fl l
List the possible devices without playing anything.
.It Fl m
Show MIDI file meta events (copyright, lyrics, etc.).
.It Fl q
Do not play the MIDI file, just parse it.
.It Fl t Ar tempo
Specifies the tempo.
Default is 100.
.It Fl v
Be verbose.
If the flag is repeated, the verbosity increases.
.It Fl x
Play a small sample sound.
.El
.Sh FILES
.Bl -tag -width /dev/music
.It Pa /dev/music
MIDI sequencer device
.El
.\".Sh ENVIRONMENT
.\".Bl -tag -width MIDIDEVICE
.\".It Pa AUDIOCTLDEVICE
.\"the audio control device to use.
.\".El
.Sh SEE ALSO
.Xr midi 4
.Sh HISTORY
The
.Nm
command first appeared in
.Nx 1.4 .
Support for RMID files was added in
.Mx 8 .
.Sh BUGS
It may take a long while before playing stops when
.Nm
is interrupted since the sequencer and MIDI buffers will still
be emptied.
