src/sbin/newfs/newfs.8
.\"	$OpenBSD: newfs.8,v 1.45 2005/06/27 10:07:15 jmc Exp $
.\"	$NetBSD: newfs.8,v 1.12 1995/03/18 14:58:41 cgd Exp $
.\"
.\" Copyright (c) 1983, 1987, 1991, 1993, 1994
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)newfs.8	8.3 (Berkeley) 3/27/94
.\"
.Dd March 27, 1994
.Dt NEWFS 8
.Os
.Sh NAME
.Nm newfs , mount_mfs
.Nd construct a new filesystem
.Sh SYNOPSIS
.Nm newfs
.Bk -words
.Op Fl NOq
.Op Fl a Ar maxcontig
.Op Fl b Ar block-size
.Op Fl c Ar cylinders
.Op Fl d Ar rotdelay
.Op Fl e Ar maxbpg
.Op Fl f Ar frag-size
.Op Fl g Ar avgfilesize
.Op Fl h Ar avgfpdir
.Op Fl i Ar bytes
.Op Fl k Ar skew
.Op Fl l Ar interleave
.Op Fl m Ar free-space
.Op Fl n Ar nrpos
.Op Fl o Ar optimization
.Op Fl p Ar sectors
.Op Fl r Ar revolutions
.Op Fl S Ar sector-size
.Op Fl s Ar size
.Op Fl t Ar fstype
.Op Fl u Ar sectors
.Op Fl x Ar sectors
.Op Fl z Ar tracks
.Ar special
.Ek
.Pp
.Nm mount_mfs
.Bk -words
.Op Fl a Ar maxcontig
.Op Fl b Ar block-size
.Op Fl c Ar cylinders
.Op Fl d Ar rotdelay
.Op Fl e Ar maxbpg
.Op Fl f Ar frag-size
.Op Fl i Ar bytes
.Op Fl m Ar free space
.Op Fl o Ar options
.Op Fl P Ar file
.Op Fl s Ar size
.Ar special node
.Ek
.Sh DESCRIPTION
Before running
.Nm
or
.Nm mount_mfs ,
the disk must be labeled using
.Xr disklabel 8 .
.Nm
builds a filesystem on the specified
.Ar special
device,
basing its defaults on the information in the disk label.
Typically the defaults are reasonable, although
.Nm
has numerous options to allow the defaults to be selectively overridden.
.Pp
.Nm mount_mfs
is used to build a filesystem in virtual memory and then mount it
on a specified node.
.Nm mount_mfs
exits and the contents of the filesystem are lost
when the filesystem is unmounted.
If
.Nm mount_mfs
is sent a signal while running,
for example during system shutdown,
it will attempt to unmount its
corresponding filesystem.
The parameters to
.Nm mount_mfs
are the same as those to
.Nm newfs .
The special file is only used to read the disk label which provides
a set of configuration parameters for the memory based filesystem.
The special file is typically that of the primary swap area,
since that is where the filesystem will be backed up when
free memory gets low and the memory supporting
the filesystem has to be paged.
If the keyword
.Dq swap
is used instead of a special file name, default configuration parameters
will be used.
(This option is useful when trying to use
.Nm mount_mfs
on a machine without any disks.)
.Pp
Both
.Nm
and
.Nm mount_mfs
now have the functionality of
.Xr fsirand 8
built in, so it is not necessary to run
.Xr fsirand 8
manually unless you wish to re-randomize the
filesystem (or list the inode generation numbers).
.Pp
The following options define the general layout policies:
.Bl -tag -width Fl
.It Fl a Ar maxcontig
This specifies the maximum number of contiguous blocks that will be
laid out before forcing a rotational delay (see the
.Fl d
option).
The default value depends on the block size
(4 for 16KB blocks, 8 for 8KB blocks, and 16 for 4KB blocks).
See
.Xr tunefs 8
for more details on how to set this option.
.It Fl b Ar block-size
The block size of the filesystem, in bytes.
The default is 16KB.
.It Fl c Ar cylinders
The number of cylinders per cylinder group in a filesystem.
The default is to use as many as fit with the other parameters given.
.It Fl d Ar rotdelay
This specifies the expected time (in milliseconds) to service a transfer
completion interrupt and initiate a new transfer on the same disk.
The default is 0 milliseconds.
See
.Xr tunefs 8
for more details on how to set this option.
.It Fl e Ar maxbpg
This indicates the maximum number of blocks any single file can
allocate out of a cylinder group before it is forced to begin
allocating blocks from another cylinder group.
The default is about one quarter of the total blocks in a cylinder group.
See
.Xr tunefs 8
for more details on how to set this option.
.It Fl f Ar frag-size
The fragment size of the filesystem in bytes.
The default is 2048.
.It Fl g Ar avgfilesize
The expected average file size for the filesystem in bytes.
.It Fl h Ar avgfpdir
The expected average number of files per directory on the filesystem.
.It Fl i Ar bytes
This specifies the density of inodes in the filesystem.
The default is to create an inode for each 8192 bytes of data space.
If fewer inodes are desired, a larger number should be used;
to create more inodes a smaller number should be given.
.It Fl m Ar free-space
The percentage of space reserved from normal users; the minimum free
space threshold.
The default value used is 5%.
See
.Xr tunefs 8
for more details on how to set this option.
.It Fl N
Causes the filesystem parameters to be printed out
without really creating the filesystem.
.It Fl n Ar nrpos
The number of distinct rotational positions.
The default is 1.
.It Fl O
Creates a
.Bx 4.3
format filesystem.
This option is primarily used to build root filesystems
that can be understood by older boot ROMs.
.It Fl o Ar optimization
.Ar space
or
.Ar time .
The filesystem can either be instructed to try to minimize the time spent
allocating blocks, or to try to minimize the space fragmentation on the disk.
Unless an optimization has been specified, if the value of minfree
(see above) is less than 5%, the default is to optimize for space;
if the value of minfree is greater than or equal to 5%,
the default is to optimize for time.
See
.Xr tunefs 8
for more details on how to set this option.
.It Fl q
Operate in quiet mode.
With this option,
.Nm
will not print extraneous information like superblock backups.
.It Fl s Ar size
The size of the filesystem in sectors.
The maximum size of a filesystem is 2,147,483,647 (2^31 \- 1) sectors,
which is slightly less than 1TB.
.El
.Pp
The following options override the standard sizes for the disk geometry.
Their default values are taken from the disk label.
Changing these defaults is useful only when using
.Nm
to build a filesystem whose raw image will eventually be used on a
different type of disk than the one on which it is initially created
(for example on a write-once disk).
Note that changing any of these values from their defaults will make
it impossible for
.Xr fsck 8
to find the alternate superblocks if the standard superblock is lost.
.Bl -tag -width Fl
.It Fl k Ar skew
Used to describe perturbations in the media format to compensate for
a slow controller.
Track skew is the offset of sector 0 on track N relative to sector 0
on track N\-1 on the same cylinder.
.It Fl l Ar interleave
Used to describe perturbations in the media format to compensate for
a slow controller.
Interleave is physical sector interleave on each track,
specified as the denominator of the ratio:
.Dl sectors read/sectors passed over
Thus an interleave of 1/1 implies contiguous layout, while 1/2 implies
logical sector 0 is separated by one sector from logical sector 1.
.It Fl p Ar sectors
Spare sectors (bad sector replacements) are physical sectors that occupy
space at the end of each track.
They are not counted as part of the sectors/track
.Pq Fl u
since they are not available to the filesystem for data allocation.
.It Fl r Ar revolutions
The speed of the disk in revolutions per minute.
.It Fl S Ar sector-size
The size of a sector in bytes (almost never anything but 512).
.It Fl t Ar fstype
Set the filesystem type of which filesystem you wish to create.
.Nm
will be smart enough to run the alternate newfs_XXX program instead.
.It Fl u Ar sectors
The number of sectors per track available for data allocation by the file
system.
This does not include sectors reserved at the end of each track for bad
block replacement (see the
.Fl p
option).
.It Fl x Ar sectors
Spare sectors (bad sector replacements) are physical sectors that occupy
space at the end of the last track in the cylinder.
They are deducted from the sectors/track
.Pq Fl u
of the last track of each cylinder since they are not available to the file
system for data allocation.
.It Fl z Ar tracks
The number of tracks/cylinder available for data allocation by the file
system.
.El
.Pp
The options to the
.Nm mount_mfs
command are as described for the
.Nm
command, except for the
.Fl o
and
.Fl P
options.
.Pp
These options are as follows:
.Bl -tag -width indent
.It Fl o Ar options
Options are specified with a
.Fl o
flag followed by a comma separated string of options.
See the
.Xr mount 8
man page for possible options and their meanings.
.It Fl P Ar file
If
.Ar file
is a directory, populate the created mfs filesystem with the contents
of the directory.
If
.Ar file
is a block device, populate the created mfs filesystem with
the contents of the FFS filesystem contained on the device.
.El
.Pp
If the
.Fl P Ar file
option is not used, the owner and mode of the created mfs filesystem will
be the same as the owner and mode of the mount point.
.Sh ENVIRONMENT
.Bl -tag -width TMPDIR
.It Ev TMPDIR
Directory in which to create temporary mount points for use by
.Nm mount_mfs Fl P
instead of
.Pa /tmp .
.El
.Sh SEE ALSO
.Xr disktab 5 ,
.Xr fs 5 ,
.Xr disklabel 8 ,
.Xr dumpfs 8 ,
.Xr fsck 8 ,
.Xr fsirand 8 ,
.Xr growfs 8 ,
.Xr mount 8 ,
.Xr tunefs 8
.Rs
.%A M. McKusick
.%A W. Joy
.%A S. Leffler
.%A R. Fabry
.%T A Fast Filesystem for UNIX
.%J ACM Transactions on Computer Systems 2
.%V 3
.%P pp 181-197
.%D August 1984
.%O (reprinted in the BSD System Manager's Manual)
.Re
.Sh HISTORY
The
.Nm
command appeared in
.Bx 4.2 .
