src/sbin/mount_ffs/mount_ffs.8
.\"	$OpenBSD: mount_ffs.8,v 1.15 2003/07/03 08:23:15 jmc Exp $
.\"	$NetBSD: mount_ffs.8,v 1.2 1996/02/05 06:33:47 jtc Exp $
.\"
.\" Copyright (c) 1980, 1989, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)mount.8	8.7 (Berkeley) 3/27/94
.\"
.Dd March 27, 1994
.Dt MOUNT_FFS 8
.Os
.Sh NAME
.Nm mount_ffs
.Nd mount a Berkeley Fast Filesystem
.Sh SYNOPSIS
.Nm mount_ffs
.Op Fl o Ar options
.Ar special node
.Sh DESCRIPTION
The
.Nm
command attaches the Berkeley Fast Filesystem on the
.Ar special
device on to the filesystem tree at point
.Ar node .
.Pp
This command is invoked by
.Xr mount 8
when using any of the following syntax:
.Bd -ragged -offset 4n
.Nm mount Op options
.Ar special Ar node
.br
.Nm mount Op options
-t ffs
.Ar special Ar node
.br
.Ed
.Pp
The
.Ar special
device must correspond to a partition registered in the
.Xr disklabel 5 .
.Pp
This command is normally executed per filesystem by
.Xr rc 8
at boot time using the
.Xr mount 8
command.
The options are as follows:
.Bl -tag -width Ds
.It Fl o Ar options
Options are specified with a
.Fl o
flag followed by a comma separated string of options.
See the
.Xr mount 8
man page for possible options and their meanings.
.El
.Sh SEE ALSO
.Xr mount 2 ,
.Xr disklabel 5 ,
.Xr fstab 5 ,
.Xr disklabel 8 ,
.Xr mount 8 ,
.Xr umount 8
.Sh HISTORY
A
.Nm
command appeared in
.Nx 1.0a .
.Sh BUGS
It is possible for a corrupted filesystem to cause a crash.
