src/share/man/man4/plip.4
.\" $MirOS: src/share/man/man4/plip.4,v 1.1.7.1 2005/03/06 16:33:41 tg Exp $
.\"
.\" Copyright (c) 2002 Martin Husemann <martin@rumolt.teuto.de>
.\" Copyright (c) 2003 Thorsten Glaser <tg@66h.42h.de>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd January 29, 2002
.Dt PLIP 4 i386
.Os
.Sh NAME
.Nm plip
.Nd networking via the standard PC parallel port
.Sh SYNOPSIS
.Cd "option	PLIP				# Ethernet over parallel port"
.Cd "lpt0	at isa? port 0x378 irq 7	# standard PC parallel ports"
.Cd "lpt1	at isa? port 0x278 irq 5"
.Cd "lpt2	at isa? port 0x3bc irq 5	# Hercules cards don't have an IRQ"
.Sh DESCRIPTION
The
.Nm
network interface shows up as
.Pa plip0
when using
.Pa lpt0 ,
as
.Pa plip1
when using
.Pa lpt1
and
.Pa plip2
when using
.Pa lpt2 .
.Pp
A parallel port can not drive a
.Nm
interface when configured without an irq.
The port can be used to drive other devices when the corresponding
.Nm
interface is configured down.
.Pp
The
.Nm
interface simulates Ethernet on a parallel cable
with special wiring (see below), known as a
.Ar "parallel LapLink cable"
widely available from PC shops.
.Pp
Its acronym is derived from SLIP and means
.Ar "Parallel IP Protocol" ,
which, in fact, is wrong: it can handle any protocol available on
Ethernet, not just IP.
.Pp
Although a
.Nm
connection always is point-to-point, the interface is configured
like every standard Ethernet interface and uses
.Ar ARP
to find its neighbor.
This is inefficient, but provides interoperability
with other operating systems.
.Pp
Set the link2 flag on the interface if it is not working.
Please report back if it helps for you.
.Sh INTEROPERABILITY
.Nm
uses the
.Ar "Crynwr protocol"
(CLPIP) defined by Russel Nelson <nelson@crynwr.com>.
This makes it interoperable with the GPL licenced MS-DOS packet driver
.Ar "PLIP.COM"
available by anonymous ftp from
.Pa ftp://ftp.crynwr.com/drivers/plip.zip
and Linux 1.3.x (make sure to configure the interface to use
.Ar ARP
when connecting to a Linux system).
.Sh WIRING
The following describes the connection of two male 25 pin sub-D connectors
which fit into standard PC parallel ports (no, PCs don't use Centronics
connectors).
.Bl -tag -width "GROUND(25)" -offset indent -compact
.It INIT(16)
INIT(16)
.It SLCTIN(17)
SLCTIN(17)
.It GROUND(25)
GROUND(25)
.It D0(2)
ERROR(15)
.It D1(3)
SLCT(13)
.It D2(4)
PAPOUT(12)
.It D3(5)
ACK(10)
.It D4(6)
BUSY(11)
.El
.Pp
Additional grounds are 18, 19, 20, 21, 22, 23 and 24.
Do not connect D5(7), D6(8), D7(9), STROBE(1) and FEED(14).
.Sh SEE ALSO
.Xr ifconfig 8 ,
.Xr pppd 8 ,
.Xr slip 8
.Sh AUTHORS
Matthias Pfaller wrote the original
.Nx
pc532 version.
.Pp
Martin Husemann ported it to the
.Nx
i386 .
.Pp
Thorsten Glaser first ported the port of the
.Nx
i386 version for
.Ox
by Pablo Ruiz Garcia to
.Mx ,
then re-did the port using a newer
.Nx
source version for
.Mx 7 .
.Sh BUGS
The
.Nm
driver has not yet been successfully tested on
.Mx .
.Pp
The driver uses a hard-coded network soft interrupt, which is the only
thing that makes it i386 architecture dependent.
As soon as generic soft interrupt allocation is available,
this should be changed, which would make the driver machine
independent (but still dependent on the ISA parallel port architecture).
.Pp
The protocol is too much overhead, a bidirectional input/output
routine switchable to a well-designed network line discipline
with on-line compression would be far superior.
.Fx
does this, but it makes it impossible to communicate with MS-DOS
and Linux boxen.
.Pp
There are some parallel ports which can use all 8 data bits for input
and output, you can make up a parallel handshake protocol and a cable
with different wiring to get an 8 bit clean (instead of 4 bit now)
data path out of this.
This is currently not supported.
.Pp
There is apparently work on the way (the parbus) which will integrate
this and other parallel-port devices (zip drives e.a.) more smoothly.
.Pp
The
.Nm
driver cannot currently drive a protocol other than IPv4.
.Sh HINTS
Go buy a pocket Ethernet adaptor or a PCMCIA Ethernet adaptor and
write a driver for it.
It has much better throughput, lower load and
a less coupled system between client and server.
