src/sbin/tunefs/tunefs.8
.\"	$OpenBSD: tunefs.8,v 1.22 2004/07/28 21:27:52 jmc Exp $
.\"	$NetBSD: tunefs.8,v 1.8 1995/03/18 15:01:29 cgd Exp $
.\"
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)tunefs.8	8.2 (Berkeley) 12/11/93
.\"
.Dd December 11, 1993
.Dt TUNEFS 8
.Os
.Sh NAME
.Nm tunefs
.Nd tune up an existing filesystem
.Sh SYNOPSIS
.Nm tunefs
.Op Fl Ap
.Op Fl a Ar maxcontig
.Op Fl d Ar rotdelay
.Op Fl e Ar maxbpg
.Op Fl f Ar avgfilesize
.Bk -words
.Op Fl m Ar minfree
.Ek
.Op Fl n Ar avgfpdir
.Bk -words
.Op Fl o Ar optimize_preference
.Ek
.Bk -words
.Op Ar special | Ar filesys
.Ek
.Sh DESCRIPTION
.Nm
is designed to change the dynamic parameters of a filesystem
which affect the layout policies.
The parameters which are to be changed are indicated by the flags
given below:
.Bl -tag -width Ds
.It Fl A
The filesystem has several backups of the super-block.
Specifying this option will cause all backups to be modified as well as the
primary super-block.
This is potentially dangerous - use with caution.
.It Fl a Ar maxcontig
This specifies the maximum number of contiguous blocks that will
be laid out before forcing a rotational delay (see
.Fl d
below).
The default value depends on the block size
(4 for 16KB blocks, 8 for 8KB blocks and 16 for 4KB blocks).
Most device drivers can chain several buffers together in a single transfer.
For optimal performance, the value of
.Ar maxcontig
should be chosen based on the maximum chain length supported by
the device driver.
.It Fl d Ar rotdelay
This specifies the expected time (in milliseconds)
to service a transfer completion
interrupt and initiate a new transfer on the same disk.
It is used to decide how much rotational spacing to place between
successive blocks in a file.
.It Fl e Ar maxbpg
This indicates the maximum number of blocks any single file can
allocate out of a cylinder group before it is forced to begin
allocating blocks from another cylinder group.
Typically this value is set to about one quarter of the total blocks
in a cylinder group.
The intent is to prevent any single file from using up all the
blocks in a single cylinder group,
thus degrading access times for all files subsequently allocated
in that cylinder group.
The effect of this limit is to cause big files to do long seeks
more frequently than if they were allowed to allocate all the blocks
in a cylinder group before seeking elsewhere.
For filesystems with exclusively large files,
this parameter should be set higher.
.It Fl f Ar avgfilesize
Specifies the expected average file size in bytes.
This value could be used for various optimizations, but for now it is only
used together with
.Ar avgfpdir
to optimize the directory allocation policy.
To take effect, both
.Ar avgfpdir
and
.Ar avgfilesize
must be greater than zero.
(Also see
.Ar avgfpdir . )
.It Fl m Ar minfree
This value specifies the percentage of space held back
from normal users; the minimum free space threshold.
The default value used is 5%.
This value can be set to zero; however, a factor of up to three
in throughput will be lost over the performance obtained at a 5%
threshold.
Note that if the value is raised above the current usage level,
users will be unable to allocate files until enough files have
been deleted to get under the higher threshold.
.It Fl n Ar avgfpdir
Specifies the expected average number of files per directory in
the filesystem.
This value is used only if both
.Ar avgfilesize
and
.Ar avgfpdir
are greater than zero.
It is used to limit number of directories which may be allocated one after
another in the same cylinder group without intervention by regular files.
This value does not affect most filesystem operations but is useful for
applications which at first create a directory structure and then populate
with files later.
(Also see
.Ar avgfilesize . )
.It Fl o Ar optimize_preference
The filesystem can either try to minimize the time spent
allocating blocks, or it can attempt to minimize the space
fragmentation on the disk.
If the value of
.Ar minfree
(see above) is less than 5%,
then the filesystem should optimize for space to avoid
running out of full sized blocks.
For values of
.Ar minfree
greater than or equal to 5%,
fragmentation is unlikely to be problematical, and
the filesystem can be optimized for time.
.It Fl p
This option shows a summary of what the current tuneable settings
are on the selected filesystem.
More detailed information can be obtained in the
.Xr dumpfs 8
manual page.
.El
.Sh SEE ALSO
.Xr fs 5 ,
.Xr dumpfs 8 ,
.Xr growfs 8 ,
.Xr newfs 8
.Rs
.%A M. McKusick
.%A W. Joy
.%A S. Leffler
.%A R. Fabry
.%T "A Fast Filesystem for UNIX"
.%J "ACM Transactions on Computer Systems 2"
.%N 3
.%P pp 181-197
.%D August 1984
.%O "(reprinted in the BSD System Manager's Manual, SMM:5)"
.Re
.Sh HISTORY
The
.Nm
command appeared in
.Bx 4.2 .
.Sh BUGS
This program should work on mounted and active filesystems.
Because the super-block is not kept in the buffer cache,
the changes will only take effect if the program
is run on dismounted filesystems.
To change the root filesystem, the system must be rebooted
after the filesystem is tuned.
.Pp
.\" Take this out and a Unix Demon will dog your steps from now until
.\" the time_t's wrap around.
You can tune a filesystem, but you can't tune a fish.
