src/share/man/man9/random.9
.\"	$MirOS: src/share/man/man9/random.9,v 1.4 2007/02/02 16:45:13 tg Exp $
.\"	$OpenBSD: random.9,v 1.19 2004/04/04 13:19:36 jmc Exp $
.\"
.\" Copyright (c) 1996,2000 Michael Shalayeff
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd $Mdocdate$
.Dt RND 9
.Os
.Sh NAME
.Nm random
.Nd device kernel interface
.Sh SYNOPSIS
.Fd #include <dev/rndvar.h>
.Ft void
.Fn add_true_randomness "int"
.Ft void
.Fn add_timer_randomness "int"
.Ft void
.Fn add_mouse_randomness "int"
.Ft void
.Fn add_tty_randomness "int"
.Ft void
.Fn add_disk_randomness "int"
.Ft void
.Fn add_net_randomness "int"
.Ft void
.Fn add_audio_randomness "int"
.Ft void
.Fn add_video_randomness "int"
.Ft void
.Fn add_imacs_randomness "int"
.Ft void
.Fn get_random_bytes "void *buf" "size_t nbytes"
.Ft u_int32_t
.Fn arc4random "void"
.Ft void
.Fn arc4random_buf "void *buf" "size_t len"
.Ft void
.Fn rnd_lopool_add "const void *buf" "size_t len"
.Ft void
.Fn rnd_lopool_addh "const void *buf" "size_t len"
.Ft void
.Fn rnd_lopool_addv "unsigned long"
.Sh DESCRIPTION
The
.Fn add_mouse_randomness ,
.Fn add_tty_randomness ,
.Fn add_net_randomness ,
.Fn add_disk_randomness ,
.Fn add_audio_randomness ,
.Fn add_video_randomness ,
and
.Fn add_imacs_randomness
routines are used to
supply data for the random data source device for further processing.
The processing involves calculating inter-event time delta and measuring
entropy contained in the resulting delta-T; the argument data supplied
is just mixed into the pool and does not increase the entropy counter.
.Pp
.Fn add_true_randomness
does not involve the usual timing calculations,
and causes the supplied data argument to be added to the entropy pool,
increasing the entropy counter by 32 bits.
.Pp
.Fn add_timer_randomness
will not cause the entropy counter to rise.
It is used to change the state of the pool periodically,
mostly by means of timing the random driver's operations.
.Pp
.Fn get_random_bytes
may be used to retrieve strong random data, just
as it would by the
.Xr srandom 4
device.
.Pp
.Fn arc4random
will give random 32 bit numbers hashed with
the ARC4 algorithm, which appears to be faster and less abusive
to the entropy pool.
.Fn arc4random_buf
will fill a buffer with bytes from the same source.
.Pp
.Fn rnd_lopool_add
will add bytes from
.Xr wrandom 4
and other
.Dq untrusted
sources via two temporary pools, one using the one-at-a-time hash,
the other using the arcfour stream cipher, into the arc4random pool.
.Fn rnd_lopool_addh
will hash the input into a 32-bit number first, and
.Fn rnd_lopool_addv
takes an integral argument instead of a buffer.
.Sh SEE ALSO
.Xr arc4random 3 ,
.Xr pchb 4 ,
.Xr random 4
.Sh CAVEATS
None of these functions should really be called during the
.Xr autoconf 4
process.
Calling
.Nm arc4random
however is safe at any time since
.Mx 11 .
