src/share/man/man9/style.9
.\" $MirOS: src/share/man/man9/style.9,v 1.9 2007/05/18 00:32:44 tg Exp $
.\" $OpenBSD: style.9,v 1.40 2005/07/09 08:05:08 jmc Exp $
.\"-
.\" Copyright (c) 2002-2008 The MirOS Project.
.\" Copyright (c) ? OpenBSD
.\" Copyright (c) 1995 FreeBSD Inc.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL [your name] OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"-
.Dd $Mdocdate$
.Dt STYLE 9 IMP
.Os
.Sh NAME
.Nm style
.Nd "Kernel source file style guide (KNF)"
.Sh DESCRIPTION
This file specifies the preferred style for kernel source files in the
.Mx
source tree.
It is also a guide for preferred userland code style.
These guidelines should be followed for all new code.
In general, code can be considered
.Dq new code
when it makes up about 50% or more of the file(s) involved.
This is enough to break precedents in the existing code and use the
current style guidelines.
.Bd -literal -offset indent
/*
 * Style guide for the MirOS Project's Coding Styles,
 * derived from the OpenBSD KNF (Kernel Normal Form).
 */

/*
 * VERY important single-line comments look like this.
 */

/* almost all small single-line comments look like this */
/* Others are sentences, thus end with a full stop. */

/*
 * Multi-line comments look like this. Make them real sentences,
 * in contrast to single-line comments. Fill them so they look
 * like real paragraphs.
 * British spelling is preferred in general. Restrict yourself
 * to the ISO_646.irv:1991 7-bit character set.
 */
.Ed
.Pp
Kernel include files (i.e.,
.Aq Pa sys/*.h )
come first; normally, you'll need either
.Aq Pa sys/types.h
or
.Aq Pa sys/param.h ,
but not both!
.Aq Pa sys/param.h
includes
.Aq Pa sys/types.h ,
which in turn
includes
.Aq Pa sys/cdefs.h ,
and it's okay to depend on that.
Also, add
.Aq Pa sys/time.h
before the other system includes, but after
.Aq Pa sys/types.h .
.Bd -literal -offset indent
#include <sys/types.h>	/* non-local includes in brackets */
.Ed
.Pp
Machine and device includes follow.
If it's a networked programme, put the network include files next.
.Bd -literal -offset indent
#include <net/if.h>
#include <net/if_dl.h>
#include <net/route.h>
#include <netinet/in.h>
#include <protocols/rwhod.h>
.Ed
.Pp
Then there's an optional blank line, followed by the
.Pa /usr/include
files.
The list of include files should be sorted by group, i.e.,
.Aq Pa sys/param.h
and
.Aq Pa sys/time.h
first, then all other system includes sorted,
then machine and device includes sorted (if possible),
then network includes sorted (if possible), then
.Pa /usr/include
files sorted, then local includes (also sorted if possible).
.Bd -literal -offset indent
#include <stdio.h>
.Ed
.Pp
Global pathnames are defined in
.Aq Pa paths.h .
Pathnames local to the programme go in
.Dq Pa pathnames.h
in the local directory.
.Bd -literal -offset indent
#include <paths.h>
.Ed
.Pp
Then there's a mandatory blank line, and the user include files.
.Bd -literal -offset indent
#include "pathnames.h"	/* local includes in double quotes */
.Ed
.Pp
The includes block is separated by another blank line from the file
identification block.
Add the CVS (or RCS) ID of the file and, if taking over old source
code, the SCCS ID as well; place another blank line after that.
It is discouraged listing RCS IDs as comments at the beginning of
files if it's possible (this excludes e.g. header files) to use
these macros; copy them over, the macros are safe to be used more
than once in the same file.
Note that this may introduce CVS branch merge conflicts.
These two macros are defined in
.Aq Pa sys/cdefs.h :
.Bd -literal -offset indent
__SCCSID("@(#)foo.c     4.5 (Berkeley) 4/18/91");
__RCSID("$MirOS\&$");
.Ed
.Pp
All functions are prototyped somewhere.
.Pp
Function prototypes for private functions (i.e., functions not used
elsewhere) go at the top of the first source module.
In userland, functions local to one source module should be declared
.Ql static .
This should not be done in kernel land since it makes it almost
impossible to use the kernel debugger.
.Pp
Functions used from other parts of the kernel are prototyped in the
relevant include file.
.Pp
Functions that are used locally in more than one module go into a
separate header file, e.g.,
.Dq Pa extern.h .
This file is allowed to precede the, otherwise sorted, list of
local include files.
.Pp
Use of the
.Li __P
macro has been deprecated.
It is allowed in code imported from other sources but should not be
used in native
.Mx
code.
Only write out prototypes with full variable names in manual pages;
in all other files, prototypes should not have variable names
associated with the types; i.e., use:
.Bd -literal -offset indent
void function(int);
.Ed
not:
.Bd -literal -offset indent -compact
void function(int a);
.Ed
.Pp
Lining up prototypes after type names is deprecated because it is
hard to maintain.
Existing code may however still use this practice, and there is no
reason to change it.
If lining up, prototypes may have an extra space after a tabulator
to enable function names to line up:
.Bd -literal -offset indent
static char	*function(int, const char *);
static void	 usage(void);
.Ed
.Pp
Function and macro names and their argument list, as well as cast
expressions and the value to be casted, are never separated by a space.
.Pp
Use
.Li __dead
from
.Aq Pa sys/cdefs.h
for functions that don't return, i.e.,
.Bd -literal -offset indent
__dead void abort(void);
.Ed
.Pp
In header files, put function prototypes within
.Dv __BEGIN_DECLS / __END_DECLS
matching pairs.
This makes the header file usable from languages like C++.
.Pp
Labels start at column 2 (i.e. are prefixed with only a single
space (ASCII 20 hex) character) no matter which block they are in.
.Pp
Macros are capitalised and parenthesised and should avoid side-effects.
If they are an inline expansion of a function, the function is defined
all in lowercase; the macro has the same name all in uppercase.
If the macro needs more than a single line, use braces.
Right-justify the backslashes, as the resulting definition is easier to read.
If the macro encapsulates a compound statement, enclose it in a
.Dq Li do
loop,
so that it can safely be used in
.Dq Li if
statements, like shown below.
Any final statement-terminating semicolon ought to be
supplied by the macro invocation rather than the macro, to make parsing easier
for pretty-printers and editors.
.Bd -literal -offset indent
#define	MACRO(x, y) do {					\e
	variable = (x) + (y);					\e
	(y) += 2;						\e
} while (/* CONSTCOND */ 0)
.Ed
.Pp
Enumeration values are all uppercase.
.Bd -literal -offset indent
enum enumtype { ONE, TWO } et;
.Ed
.Pp
When declaring variables in structures, declare them sorted by use, then
by size (largest to smallest), then by alphabetical order.
The first category normally doesn't apply, but there are exceptions.
Each one gets its own line.
It is recommended to not line them up either.
.Pp
Major structures should be declared at the top of the file in which they
are used, or in separate header files if they are used in multiple
source files.
Use of the structures should be by separate declarations and should be
.Dq Li extern
if they are declared in a header file.
.Bd -literal -offset indent
struct foo {
	struct foo *next;	/* list of active foo */
	struct mumble amumble;	/* comment for mumble */
	int bar;
};
struct foo *foohead;		/* head of global foo list */
.Ed
.Pp
Use
.Xr queue 3
macros rather than rolling your own lists whenever possible.
Thus, the previous example would be better written:
.Bd -literal -offset indent
#include <sys/queue.h>
struct foo {
	LIST_ENTRY(foo) link;	/* queue macro glue for foo lists */
	struct mumble amumble;	/* comment for mumble */
	int bar;
};
LIST_HEAD(, foo) foohead;	/* head of global foo list */
.Ed
.Pp
Avoid using typedefs for structure types.
This makes it impossible
for applications to use pointers to such a structure opaquely, which
is both possible and beneficial when using an ordinary struct tag.
When convention requires a typedef, make its name match the struct tag.
Avoid typedefs ending in
.Dq Li \&_t ,
except as specified in Standard C or by
.Tn POSIX ,
such as
.Dq Li uint32_t
(which requires
.Aq Pa stdint.h ,
or its superset
.Aq Pa inttypes.h ) .
Don't use the same name for a struct tag and a typedef, as this makes
the code unusable from C++.
.Bd -literal -offset indent
/* Make the structure name match the typedef */
typedef struct _bar {
	int level;
} BAR;
.Ed
.Bd -literal -offset indent
/*
 * All major routines should have a comment briefly describing what
 * they do. The comment before the "main" routine should describe
 * what the programme does.
 */
int
main(int argc, char *argv[])
{
	long num;
	int ch;
	char *ep;

.Ed
.Pp
For consistency,
.Xr getopt 3
should be used to parse options.
Options should be sorted in the
.Xr getopt 3
call and the switch statement, unless
parts of the switch cascade.
Elements in a switch statement that cascade should have a FALLTHROUGH comment.
Numerical arguments should be checked for accuracy.
Code that cannot be reached should have a NOTREACHED comment.
The CONSTCOND, FALLTHROUGH, and NOTREACHED comments benefit lint.
.Bd -literal -offset indent
while ((ch = getopt(argc, argv, "abn:")) != -1)
	switch (ch) {		/* indent the switch */
	case 'a':		/* don't indent the case */
		aflag = 1;
		/* FALLTHROUGH */
	case 'b':
		bflag = 1;
		break;
	case 'n':
		/* it's easier to use strtonum instead */
		num = strtol(optarg, &ep, 10);
		if (num <= 0 || *ep != '\e0') {
			warnx("illegal number, -n argument -- %s",
			    optarg);
			usage();
		}
		break;
	case '?':
	default:
		usage();
		/* NOTREACHED */
	}
argc -= optind;
argv += optind;
.Ed
.Pp
Use a space after keywords
.Pf ( Li if ,
.Li while ,
.Li for ,
.Li return ,
.Li sizeof ,
.Li switch ) .
It is recommended to put parentheses around the
.Li return
argument as well, although this is not a strict requirement.
.Pp
No braces are
used for control statements with zero or only a single statement unless that
statement is more than a single line, in which case they are permitted.
Forever loops are done with
.Li for ,
not
.Li while .
.Bd -literal -offset indent
for (p = buf; *p != '\e0'; ++p)
	;	/* nothing */
for (;;)
	stmt;
for (;;) {
	z = a + really + long + statement + that + needs +
	    two + lines + gets + indented + four + spaces +
	    on + the + second + and + subsequent + lines;
}
for (;;) {
	if (cond)
		stmt;
}
.Ed
.Pp
Parts of a for loop may be left empty.
Don't put declarations inside blocks unless the routine is
unusually complicated.
.Bd -literal -offset indent
for (; cnt < 15; cnt++) {
	stmt1;
	stmt2;
}
.Ed
.Pp
Indentation is an 8 character tab.
Second level indents are four spaces.
.Bd -literal -offset indent
while (cnt < 20)
	z = a + really + long + statement + that + needs +
	    two lines + gets + indented + four + spaces +
	    on + the + second + and + subsequent + lines;
.Ed
.Pp
Do not add whitespace at the end of a line, and only use tabs
followed by spaces to form the indentation.
.Nm vim
users are
.Em required
to put
.Dq Li let c_space_errors = 1
into their
.Pa ~/.vimrc .
Do not use more spaces than a tab will produce
and do not use spaces in front of tabs.
.Pp
Closing and opening braces go on the same line as the else.
Braces that aren't necessary may be left out, unless they cause
a compiler warning.
.Bd -literal -offset indent
if (test)
	stmt;
else if (bar) {
	stmt;
	stmt;
} else
	stmt;
.Ed
.Pp
Do not use spaces after function names.
Commas have a space after them.
Do not use spaces after
.Sq \&(
or
.Sq \&[
or preceding
.Sq \&]
or
.Sq \&)
characters.
.Bd -literal -offset indent
if ((error = function(a1, a2)))
	exit(error);
.Ed
.Pp
Use positive error codes.
Negative errors (except \-1) are something only the Other OS does.
.Pp
Unary operators don't require spaces; binary operators do.
Don't use parentheses unless they're required for precedence, the statement
is confusing without them, or the compiler generates a warning without them.
Remember that other people may be confused more easily than you.
Do YOU understand the following?
.Bd -literal -offset indent
a = b->c[0] + ~d == (e || f) || g && h ? i : j >> 1;
k = !(l & FLAGS);
.Ed
.Pp
Also, it's much better to break before an operator,
not after it, if you have got to apply line breaks.
This is especially true for shell scripts.
The above example could be rewritten as:
.Bd -literal -offset indent
a = b->c[0] +
    ( ~d == (e || f) || g && h ) ? i : ( j >> 1 );
k = !(l
    & FLAGS);
.Ed
.Pp
Exits should be 0 on success, or non-zero for errors.
.Bd -literal -offset indent
exit(0);	/*
		 * avoid obvious comments such as
		 * "Exit 0 on success."
		 */
}
.Ed
.Pp
The function type should be on a line by itself
preceding the function.
.Bd -literal -offset indent
static char *
function(int a1, int a2, float fl, int a4)
{
.Ed
.Pp
When declaring variables in functions, declare them sorted by size (largest to
smallest), then in alphabetical order; multiple ones per line are okay.
Old style function declarations ought to be avoided; we already live in an
ANSI C world, and ISO C99 is almost there.
ANSI style function declarations should go in an include file such as
.Dq Pa extern.h .
If a line overflows, reuse the type keyword.
.Pp
Be careful not to obfuscate the code by initializing variables in
the declarations.
Use this feature only thoughtfully.
DO NOT use function calls in initializers!
.Bd -literal -offset indent
struct foo one, *two;
double three;
int *four, five;
char *six, seven, eight, nine, ten, eleven, twelve;

four = myfunction();
.Ed
.Pp
Do not declare functions inside other functions: ANSI C says that
such declarations have file scope regardless of the nesting of the
declaration.
Hiding file declarations in what appears to be a local scope is
undesirable and will elicit complaints from a good compiler, such as
.Dq Li gcc -Wtraditional .
.Pp
Casts are not followed by a space, the
.Fn sizeof
keyword is.
Note that
.Xr indent 1
comes with a sample
.Pa .indent.pro
which
.Em does
understand this rule, starting from
.Mx 9 .
.Pp
Use of the
.Dq register
specifier is discouraged in new code.
Optimising compilers such as gcc can generally do a better job
of choosing which variables to place in registers to improve
code performance.
The exception to this is in functions containing assembly code where the
.Dq register
specifier is required for proper code generation in the absence of
compiler optimisation.
.Pp
In C99 code, use
.Dq __restrict__
instead of
.Dq restrict
if required.
The
.Aq Pa sys/cdefs.h
include file defines them out if an old compiler is used.
.Pp
When using
.Fn longjmp
or
.Fn vfork
in a programme, the
.Fl W
or
.Fl Wall
flag should be used to verify that the compiler does not generate
warnings such as
.Bd -literal -offset indent
warning: variable `foo' might be clobbered by `longjmp' or `vfork'.
.Ed
.Pp
If any warnings of this type occur, you must apply the
.Dq volatile
type-qualifier to the variable in question.
Failure to do so may result in improper code generation when optimisation
is enabled.
Note that for pointers, the location of
.Dq volatile
specifies if the type-qualifier applies to the pointer, or the thing being
pointed to.
A volatile pointer is declared with
.Dq volatile
to the right of the
.Dq * .
Example:
.Bd -literal -offset indent
char *volatile foo;
.Ed
.Pp
says that
.Dq foo
is volatile, but
.Dq *foo
is not.
To make
.Dq *foo
volatile use the syntax
.Bd -literal -offset indent
volatile char *foo;
.Ed
.Pp
If both the pointer and the thing pointed to are volatile use
.Bd -literal -offset indent
volatile char *volatile foo;
.Ed
.Pp
.Dq const
is also a type-qualifier and the same rules apply.
The description of a read-only hardware register might look something like:
.Bd -literal -offset indent
const volatile char *reg;
.Ed
.Pp
Global flags set inside signal handlers should be of type
.Dq volatile sig_atomic_t
if possible.
This guarantees that the variable may be accessed as an atomic entity,
even when a signal has been delivered.
Global variables of other types (such as structures) are not
guaranteed to have consistent values when accessed via a signal handler.
.Pp
.Dv NULL
is the preferred null pointer constant.
Use
.Dv NULL
instead of
(type\ *)0 or (type\ *)NULL in all cases except for arguments to variadic
functions where the compiler does not know the type.
Test pointers
against
.Dv NULL ,
i.e., use:
.Bd -literal -offset indent
(p = f()) == NULL
.Ed
not:
.Bd -literal -offset indent -compact
!(p = f())
.Ed
.Pp
Don't use
.Ql \&!
for tests unless it's a boolean, i.e., use
.Bd -literal -offset indent
if (*p == '\e0')
.Ed
not
.Bd -literal -offset indent -compact
if (!*p)
.Ed
.Pp
Routines returning
.Li void *
should not have their return values cast to any pointer type.
Functions used as procedures should not have their return
value explicitly cast to void, either.
.Pp
Use
.Xr err 3
or
.Xr warn 3 ,
don't roll your own!
.Bd -literal -offset indent
	if ((four = malloc(sizeof(struct foo))) == NULL)
		err(1, NULL);
	if ((six = (int *)overflow()) == NULL)
		errx(1, "Number overflowed.");
	return (eight);
}
.Ed
.Pp
Old-style function declarations looked like this:
.Bd -literal -offset indent
static char *
function(a1, a2, fl, a4)
	int a1, a2;	/* declare ints, too, don't default them */
	float fl;	/* beware double vs. float prototype differences */
	int a4;		/* list in order declared */
{
	...
}
.Ed
.Pp
Use ANSI function declarations unless you explicitly need K&R compatibility.
Even then you should really think twice about it.
Even gcc now requires an ANSI C compiler to be built.
Long parameter lists are wrapped with a normal four space indent.
.Pp
Variable numbers of arguments should look like this:
.Bd -literal -offset indent
#include <stdarg.h>

void
vaf(const char *fmt, ...)
{
	va_list ap;
	va_start(ap, fmt);

	STUFF;

	va_end(ap);

	/* No return needed for void functions. */
}

static void
usage(void)
{
	extern const char *__progname;	/* from crt0.o */
.Ed
.Pp
Usage statements should look like the manual pages.
Options without
operands come first, in alphabetical order inside a single set of
braces, followed by options with operands, in alphabetical order,
each in braces, followed by required arguments in the order they
are specified, followed by optional arguments in the order they
are specified.
.Pp
A bar
.Pq Sq \&|
separates either-or options/arguments,
and multiple options/arguments which are specified together are
placed in a single set of braces.
.Pp
If numbers are used as options, they should be placed first,
as shown in the example below.
Uppercase letters take precedence over lowercase.
Note that the options list in manual pages should be purely alphabetical,
except that the no-argument options are listed first.
.Bd -literal -offset indent
"usage: f [-12aDde] [-b b_arg] [-m m_arg] req1 req2 [opt1 [opt2]]\en"
"usage: f [-a | -b] [-c [-de] [-n number]]\en"
.Ed
.Pp
The
.Li __progname
string should be used instead of hard-coding the programme's name.
.Bd -literal -offset indent
	fprintf(stderr, "usage: %s [-ab]\en", __progname);
	exit(1);
}
.Ed
.Pp
New core kernel code should be reasonably compliant with the style guides.
The guidelines for third-party maintained modules and device drivers are more
relaxed but at a minimum should be internally consistent with their style;
the current MirPorts Framework package tools are a bad example of style
inconsistency (such as three different indentation styles: three spaces, four
spaces and KNF one tab) and a good example of why it must be prevented.
.Pp
Stylistic changes (including whitespace changes) are hard on the source
repository and are to be avoided without good reason.
Code that is approximately KNF compliant in the repository must not diverge
from compliance.
.Pp
Whenever possible, code should be run through a code checker
(e.g.,
.Dq Li make __CRAZY=Yes ,
.Dq Li gcc -Wall -W -Wtraditional -Wpointer-arith -Wbad-function-cast ... ,
.Xr lint 1
or lclint from the ports tree) and produce minimal warnings.
.Pp
Note that documentation follows its own style guide,
as documented in
.Xr mdoc.samples 7 .
This however does not invalidate the hints given in this guide.
.Sh FILES
.Bl -tag -width "/usr/share/misc/licence.template " -compact
.It Pa /usr/share/misc/licence.template
Licence preferred for new code.
.El
.Pp
.Pa ~/.indent.pro
should contain at least the following items:
.Pp
.Fl bs
.Fl c0
.Fl ci4
.Fl di0
.Fl ncsp
.Fl nfc1
.Fl nlp
.Fl nlpi
.Fl Tbool
.Fl Tint16_t
.Fl Tint32_t
.Fl Tint64_t
.Fl Tint8_t
.Fl Tintmax_t
.Fl Tintptr_t
.Fl Toff_t
.Fl Tptrdiff_t
.Fl Tsize_t
.Fl Tssize_t
.Fl Ttime_t
.Fl Tuint16_t
.Fl Tuint32_t
.Fl Tuint64_t
.Fl Tuint8_t
.Fl Tuintmax_t
.Fl Tuintptr_t
.Fl Twchar_t
.Fl Twint_t
and a bunch of others.
Note that the
.Fl c0
option might be problematic for existing code and may be better left out.
.Pp
A more complete list can be fount at
.Pa src/usr.bin/indent/.indent.pro
in the
.Mx
source code.
Even then,
.Xr indent 1
does only basic help to apply KNF.
Be warned.
.Sh SEE ALSO
.Xr indent 1 ,
.Xr err 3 ,
.Xr queue 3 ,
.Xr warn 3 ,
.Xr mdoc.samples 7
.Sh HISTORY
This man page is largely based on the src/admin/style/style file from
the
.Tn BSD
4.4-Lite2 release, with updates to reflect the current practice and
desire of the
.Ox
project, with a few annotations and some even deeper changes for the
.Mx
source tree, including a different, improved, licence template.
