src/share/man/man7/install.sparc.7
.\" $MirOS: src/share/man/man7/install.sparc.7,v 1.1 2007/10/21 16:48:10 tg Exp $
.\"-
.\" Copyright (c) 2007, 2008
.\"	Thorsten Glaser <tg@mirbsd.de>
.\"	Benny Siegert <bsiegert@mirbsd.org>
.\"
.\" Provided that these terms and disclaimer and all copyright notices
.\" are retained or reproduced in an accompanying document, permission
.\" is granted to deal in this work without restriction, including un-
.\" limited rights to use, publicly perform, distribute, sell, modify,
.\" merge, give away, or sublicence.
.\"
.\" This work is provided "AS IS" and WITHOUT WARRANTY of any kind, to
.\" the utmost extent permitted by applicable law, neither express nor
.\" implied; without malicious intent or gross negligence. In no event
.\" may a licensor, author or contributor be held liable for indirect,
.\" direct, other damage, loss, or other issues arising in any way out
.\" of dealing in the work, even if advised of the possibility of such
.\" damage or existence of a defect, except proven that it results out
.\" of said person's immediate fault when using the work as intended.
.\"-
.\" :vim:se tw=72:
.\" local convention: use .Ql for disk slice names
.\" MirOS version number
.nr v 10
.Dd $Mdocdate: October 21 2007 $
.Dt INSTALL.SPARC 7
.Os
.Sh NAME
.Nm instal.sparc
.Nd stub installation instructions for the sparc architecture
.Sh SYNOPSIS
.Nm /install
.Sh DESCRIPTION
This manual page describes how to install the
.Mx
operating system on a sparc (sun4c, sun4m) machine.
.Sh OBTAINING INSTALLATION MEDIA
The
.Mx
homepage (see below) contains a comprehensive list of possibilities to
get bootable installation media.
In many cases, you will download MirOS from the internet via HTTP or
BitTorrent.
On some conferences and fairs, you can also get CDs directly from the
developers.
You can also mail them to have a CD sent to you if you don't have
broadband.
.Pp
For more information, refer to the
.Xr install.i386 7
manual page for now.
.Pp
There is no floppy image for the sparc architecture, boot from a
CD-ROM image (either the full CD or the minimal
.Pa cdrom\nv.iso
image), or netboot a
.Pa bsd.rd
ELF format gzip'd kernel using
.Pa boot ,
formerly called
.Pa boot.net ,
or netboot a directly bootable
.Pa bsd.rd.net
a.out format kernel.
.Sh NETBOOTING
This section is a stub.
For now, refer to the
.Ox
documentation at
.Pa http://pub.allbsd.org/OpenBSD/3.5/sparc/INSTALL.sparc
for details or ask in IRC.
You can usually replace the
.Dl server# ln -s boot.MACHINE.OpenBSD.$KARCH 8273900B.$KARCH
line with
.Dl server$ sudo ln -s bsd.rd.net 8273900B.$KARCH
to make use of our netbootable kernels.
.Sh PARTITIONING
The sparc architecture does not use MBR partitioning, so that you
can skip reading about the fdisk utility in the i386 instructions.
.Sh INSTALLATION INSTRUCTIONS
Please see the
.Xr install.i386 7
manual page for a detailled walkthrough.
This manual page currently is only a stub.
.Sh SEE ALSO
.Xr boot_sparc 8 ,
.Xr disklabel 8 ,
.Xr diskless 8
.Pp
The MirOS homepage:
.Pa http://mirbsd.de/
.Sh HISTORY
Support for the sparc architecture first appeared in
.Mx 7ter .
It re-appeared in
.Mx 10 ,
promoted to a fully supported architecture.
