src/share/man/man7/install.i386.7
.\" $MirOS: src/share/man/man7/install.i386.7,v 1.2 2005/12/04 15:54:46 bsiegert Exp $
.\" :vim:se tw=72:
.\" local convention: use .Ql for disk slice names
.\" MirOS version number
.nr v 8
.\"-
.Dd October 10, 2005
.Dt INSTALL.I386 7
.Os
.Sh NAME
.Nm install.i386
.Nd installation instructions for the i386 architecture
.Sh SYNOPSIS
.Nm /Install
.Sh DESCRIPTION
This manual page describes how to install the
.Mx
operating system on an i386 (PC) machine.
.Sh OBTAINING INSTALLATION MEDIA
The
.Mx
homepage (see below) contains a comprehensive list of possibilities to
get bootable installation media.
In many cases, you will download MirOS from the internet via HTTP or
BitTorrent.
On some conferences and fairs, you can also get CDs directly from the
developers.
You can also mail them to have a CD sent to you if you don't have
broadband.
.Pp
You will need a bootable medium to start the installation and one that
contains the installation sets. For booting, you have the following
options:
.Bl -dash
.It
the "big" CD-ROM (which is bootable and contains all the installation
sets)
.It
the CD mini-ISO
.Pq burned from Pa cdrom\nv.iso
.It
a floppy disk
.Pq created from Pa floppy\nv.fs
.It
.Pa bsd.rd ,
a kernel that contains a "rescue system". This is the best solution if
you already have MirOS installed.
.It
If your machine is capable of netbooting via PXE and you have another box
that can be a bootserver, you can even do a network installation without
any physical media.
This, however, is outside of the scope of this document.
.El
.Pp
The installation sets can be fetched from the following sources:
.Bl -dash
.It 
again, the CD-ROM
.It
another filesystem on your hard disk, e.g. FAT, NTFS, ext2fs, etc.
.It
an NFS, HTTP or FTP server in your local network
.It
a USB stick or external hard drive
.It
directly from the
.Mx
homepage
.El
.Pp
To write the floppy image to a disk, use a command such as:
.Dl dd if=floppy\nv.fs of=/dev/rfd0c bs=9k
Under GNU/Linux, use
.Pa /dev/fd0
as the device name instead.
To create the floppy under DOS, use the tool 
.Cm rawrite.exe .
For MS Windows\(rg, use
.Cm rawritewin
.Pq see URL below .
.Pp
To burn the ISO image to a CD-ROM (a rewritable CD is recommended), you can
use any CD burning program.
Under
.Ux ,
use
.Cm cdrecord
for example:
.Dl cdrecord -v dev=/dev/rcd1c cdrom\nv.iso
You will need to change the device name above according to your system.
.Cm cdrecord
is available within the MirPorts Framework as
.Pa sysutils/cdrtools .
.\" --------------------------------------------------------------------
.Sh BEFORE YOU START: THOUGHTS ON PARTITIONING
You should plan the organization of your hard disk now before you start
the installation.
The BSD operating systems don't use PC-style partition tables.
Instead, they have their own scheme called a
.Dq disklabel .
Thus, you will normally create one 
.Xr fdisk 8
partition for
.Mx
which contains the disklabel and all the
.Mx
filesystems.
This partition is then subdivided into so-called
.Dq slices
using the
.Xr disklabel 8
editor.
Partitions of other operating systems (e.g. ext2fs, msdos, or ntfs
partitions) are usually automatically added to the disklabel.
In fact,
.Mx
only uses the partition entry to find its disklabel and to show other
operating systems that the space is used.
.Pp
The
.Mx
partition needs to be big enough to hold all the file systems and
the swap partition.
At least 2 Gibibytes are recommended.
It needs to be a primary or logical partition with type 0x27.
If you are using a different operating system now and you are familiar
with its partitioning tool (e.g.\&
.Tn GNU
.Cm fdisk ) ,
you can use it to create the partition before you start the installation.
This way, you avoid having to learn a new partitioning tool and minimise
the risk of data loss.
In any case, 
.Sy do a full backup of your data NOW
in case anything goes wrong during the installation or the change of the
partition table.
.Pp
In case you have only one big partition (for example, if you had only
MS Windows\(rg installed before), you need to either delete or shrink it.
For the latter, tools such as
.Cm fips , parted
or Partition Magic (commercial) can be used.
.Pp
In special cases, you can have more than one area on the disk for
.Mx .
However, you will have to calculate slice offsets yourself, so do this
only if you know what you are doing.
In this case, the other partitions should be of a type otherwise
unused in the system, such as 0xDB (CP/M-86).
.Pp
The slices inside the disklabel are named using letters.
.Bl -tag -width 5n
.It Ql a
This is always the root filesystem, i.e. the one from which you boot and
which contains the kernel.
For a full MirOS installation including XFree86\(rg, you will need at least
500 MiB of space in this partition \(em more if you want to install
third-party applications using MirPorts or binary packages.
.It Ql b
This slice is always for swap space.
As for its size, it used to be recommended to make it twice as big as
the installed RAM, but on modern systems, you can use less (say 300 MiB)
to save space.
However, more swap space does not hurt, and it can be useful for high
loads or compiling big software.
It should be noted that the installer used to force the disk with the root
filesystem to have a usable and allocated swap slice of at least 8 MiB.
.It Ql c
As this slice represents the whole disk, you cannot change its size or
put a filesystem on it.
.It Ql i
Auto-detected partitions from other operating systems are given names
from i on.
.El
.\" --------------------------------------------------------------------
.Sh STARTING THE INSTALLATION
You will now boot from the installation media you have chosen.
If you use a floppy, just insert it before rebooting.
To boot from the CD-ROM, you may need to alter the settings in your BIOS
setup.
Again, this depends on your system.
.Pp
The first thing you will see is the MirOS bootloader. 
A boot prompt will appear:
.Dl boot>
Wait a few seconds (depending on the installation medium) or enter the
boot command shown to load the kernel and begin with the installation.
You will see lots of messages on a blue background scroll by.
These are the normal kernel startup messages while your hardware is being
probed and the appropriate drivers are loaded.
Once the kernel has finished loading, you will be asked:
.Dl (I)nstall, (U)pgrade, or (S)hell?
Press the
.Ql I
key to start the installation procedure.
.Pp
You will be greeted with a welcome message:
.Bd -ragged -offset indent
Welcome to the MirOS BSD #\nv/i386 install program.

This program will help you install MirOS. At any prompt except password prompts
you can run a shell command by typing '!foo', or escape to a shell by typing
'!'. Default answers are shown in []'s and are selected by just RETURN, but
sometimes there is no default. At any time you can exit this programme by
pressing Control-C and then RETURN, but quitting during an install can leave
your system in an inconsistent state.

Terminal type? [wsvtg]
.Ed
Simply press Enter at this prompt.
.Pp
The next question is:
.D1 \&Do you wish to select a keyboard encoding table?
If you want to use the default US keyboard table, press Enter.
If not, enter 
.Ic yes
here and select your layout at the next prompts.
.Bd -ragged -offset indent
IS YOUR DATA BACKED UP? As with anything that modifies disk contents, this
program can cause SIGNIFICANT data loss.

It is often helpful to have the installation notes handy. For complex disk
configurations, relevant disk hardware manuals and a calculator are useful.

Proceed with install? [no]
.Ed
This is the point where you should stop if you do not really want to do
the installation now.
If you are really sure you want to continue and if you have planned your
disk layout (see above), then enter
.Ic yes
now to continue.
.Bd -ragged -offset indent
Cool! Let's get into it...

You will now initialise the disk(s) that MirBSD will use. To enable all
available security features you should configure the disk(s) to allow the
creation of separate filesystems for /, /tmp, /var, /usr, and /home.

Available disks are: wd0.
Which disk is the root disk (or 'done') [wd0]
.Ed
Enter the name of the hard disk you want to install
.Mx
on.
The first IDE hard disk is
.Ql wd0 ,
while the first SCSI hard disk is
.Ql sd0 .
.Pp
The next steps are partitioning with
.Xr fdisk 8
and
.Xr disklabel 8 .
See the section above for advice \(em you should have read it by now
anyway.
Enter the partition scheme you planned earlier here.
If you want to use
.Mx
exclusively on the hard disk, say
.Ic yes
on the next question:
.D1 \&Do you want to use Sy all No "of wd0 for MirBSD? [no]"
In most cases, you will say
.Ic no
here, so
.Xr fdisk 8
will be started.
.Pp
You will get a prompt from fdisk that looks like this:
.D1 fdisk: 1>
The
.Ic print
command will show the current table.
If you think you made a mistake, use the
.Ic exit
command to quit fdisk without saving any changes.
.Ic quit
saves the changes and exit.
.Pp
As an example of fdisk use, we will create one partition on an otherwise
empty hard disk here.
At the fdisk prompt, we edit the first entry in the partition table by
entering
.Ic edit 0 .
.Bd -literal -offset indent
         Starting       Ending       LBA Info:
 #: id    C   H  S -    C   H  S [       start:      size   ]
---------------------------------------------------------------------
!0: 00    0   0  0 -    0   0  0 [           0:           0 ] unused
Partition id ('0' to disable)  [0 - FF]: [0] (? for help) 27
Do you wish to edit in CHS mode? [n] y
BIOS Starting cylinder [0 - 1014]: [0] 0
BIOS Starting head [0 - 15]: [0] 1
BIOS Starting sector [1 - 63]: [0] 1
BIOS Ending cylinder [0 - 1014]: [0] 1014
BIOS Ending head [0 - 15]: [0] 15
BIOS Ending sector [1 - 63]: [0] 63
fdisk:*1> flag 0
Partition 0 marked active.
fdisk:*1>
.Ed
.Pp
It is very important that the first partition begins on head 1 and not
on head 0 (i.e. at sector 63) to leave some space for the partition
table.
As you see, the prompt in fdisk is now marked with an asterisk.
This means that the partition table was changed.
Type
.Ic quit
now to save it and quit fdisk.
.Bd -ragged -offset indent
You will now create a MirBSD disklabel inside the MirBSD MBR partition. The
disklabel defines how MirBSD splits up the MBR partition (rather, the whole
disk) into MirBSD slices in which filesystems and swap space are created.

The offsets used in the disklabel are ABSOLUTE, i.e. relative to the
start of the disk, NOT the start of the MirBSD MBR partition.

If you have created a split space, i.e. one partition of type 27 and one or
more partitions of type (e.g.) DB, use the command b<return>0<return>*<return>
to enable using the entire disk for MirBSD. Be sure to create slices mapping
the filesystems of any other operating systems in order to not overwrite them.

# Inside MBR partition 0: type 27 start 63 (0x3F) size 1023057 (0xF9C51).

Treating sectors 63-1023120 as the MirBSD portion of the disk.
You can use the 'b' command to change this.

Initial label editor (enter '?' for help at any prompt)

>
.Ed
.Pp
To see your current disklabel, use the
.Ic p
command.
To add a slice in the disklabel editor, enter
.Ic a
followed by the slice name, for example
.Ic a a .
To create a slice, enter its offset
.Pq the starting point ,
size, and mount point.
Offset and size values are in sectors, thus twice their size in
kibibytes.
Note that it is also possible to use a number and a modifier, for
example
.Ic 250M
for a partition of 256 MiB or
.Ic 2G
for a partition of 2 Gibibytes.
.Pp
The default value for the offset is the beginning of free space, thus it
is the right one if you add the partitions one after another.
The default value for the size is the remaining space.
Always leave the default when asked for the FS type.
A very simple example with just two slices follows:
.Bd -literal -offset indent
> a a
offset: [63]
size: [1023057] 896000
FS type: [4.2BSD]
mount point: [none] /
> a b
offset: [896063]
size: [127057]
FS type: [swap]
>
.Ed
Type
.Ic q
to quit and save your changes or
.Ic x
to quit without saving if you made a mistake and want to redo the
disklabel or the partitioning.
.Pp
After the disklabel is created, the new filesystems will be initialised
.Pq erased :
.Bd -ragged -offset indent
The root filesystem will be mounted on wd0a.
wd0b will be used for swap space.
No more disks to initialise.

You have configured the following partitions and mount points:

wd0a /

The next step creates a filesystem on each partition, ERASING existing data.
Are you really sure that you're ready to proceed? [no]
.Ed
This is really your last chance to abort.
To continue, enter
.Ic yes .
.\" --------------------------------------------------------------------
.Sh INITIAL NETWORK CONFIGURATION
.D1 System hostname? (short form, e.g. 'foo')
After the creation of the filesystems, you will be asked for the host
name of the system.
This is the name that you give your computer, without the domain name.
It should be unique on your local network.
Many people use some kind of naming scheme for their machines, for
example the last names of their favourite authors.
.Pp
.D1 Configure the network? [yes]
If you say
.Ic no
here, you can skip the whole network configuration.
This is useful if you do not have a local network or if you want to
configure it by hand later.
However, if you want to fetch the installation sets over the network,
you must do the configuration now.
.Bd -ragged -offset indent
Available interfaces are: ne3 plip0 irip0 irip1.
Which one do you wish to initialise? (or 'done') [ne3]
.Ed
Now, you need to figure out the name of your local network interface.
Under
.Mx ,
network interfaces have a the name of their driver plus a number.
.Ql plip0 , irip0
and
.Ql irip1
are "virtual" interfaces, thus the LAN interface in this example is
.Ql ne3 .
.Bd -ragged -offset indent
The media options for ne3 are currently

	media: Ethernet autoselect (10baseT)

Do you want to change the media options? [no]
.Ed
The default media type of "Ethernet autoselect" is sufficient in most
cases.
Say
.Ic yes
here if you want to fix the speed or the cable type manually.
The latter might be necessary for cards with 10baseT via RJ-45 and
10base2 via coaxial cables, or if your switch is broken.
.Pp
.D1 IPv4 address for ne3? (or 'none' or 'dhcp')
Enter the IPv4 address of the interface here.
If you want to automatically configure the parameters using
.Tn DHCP
.Pq Dynamic Host Configuration Protocol ,
enter
.Ic dhcp .
If you do not want to give the interface an IPv4 address, enter
.Ic none .
If you are not sure what to do, ask your network administrator or try
.Ic dhcp .
.D1 Netmask? [255.255.255.0]
Enter the subnet mask here.
In most cases, you can keep the default.
.Pp
Now you are brought back to the interface selector from before, where
you can configure additional network interfaces if you want.
Enter
.Ic done
after you finished configuring the last one.
.Pp
.D1 DNS Domain name? (e.g. 'bar.com') [my.domain]
Enter the internet domain name of your computer here.
If you do not have your own domain, then use something like
.Ic invalid ,
but never enter a domain name that belongs to someone else.
.Pp
.D1 DNS Nameserver? (IP address or 'none) [none]
Enter the name of your local domain name server here.
If you used
.Tn DHCP
before, the nameserver has been configured automatically, and you can
just leave the default.
If you use a DSL router or something similar, enter the address your
ISP gave you.
If you do not want to use a nameserver now, enter
.Ic none .
.Pp
.D1 Edit hosts with ed? [no]
If you enter
.Ic yes
here, you can edit the
.Pa /etc/hosts
file with
.Cm ed .
This file contains a static table of host names and corresponding IP
addresses.
You will almost never need this.
.Pp
.D1 Password for root account? (will not echo)
Enter the password for the superuser (root) account here.
It is very important that you pick a good password.
Do not write it down, keep it to yourself and do not forget it.
If somebody else figures out this password, he can do everything on your
machine.
If you forget your root password, you will have to use a rescue system
.Pq like Pa bsd.rd
to reset it.
.\" --------------------------------------------------------------------
.Sh INSTALLING THE SETS
The installation sets are compressed archives that contain the different
parts of
.Mx
proper.
.Bd -ragged -offset indent
You will now specify the location and names of the install sets you want
to load. You will be able to repeat this step until all of your sets
have been successfully loaded. If you are not sure what sets to install,
refer to the installation notes for details on the contents of each.

Sets can be located on a (m)ounted filesystem; a (c)drom, (d)isk or
(t)ape device; or a (f)tp, (n)fs or (h)ttp server.

Where are the install sets? (or 'done')
.Ed
If you have the "big" CD-ROM, just enter
.Ic c
here and accept the defaults for the next questions.
For an installation via interhet, enter
.Ic h
and also accept the defaults.
.Pp
In any case, you will be dropped into the install set selector.
The available sets are:
.Bl -tag -width 6n
.It Pa base\nv.ngz
As the name implies, this set contains the base files and directories.
You want this.
.It Pa bsd
The operating system kernel.
You need this.
.It Pa bsd.rd
A kernel image that boots into a "rescue system" that is contained
within the image itself.
A very handy tool for system recovery and later upgrades.
.It Pa dev\nv.ngz
The GNU Compiler Collection, binutils, system headers, static libraries
and manual pages and associated documentation for developers.
You will need this if you want to install additional software using
the MirPorts Framework, or want to develop or compile yourself.
For most normal systems, you will want this; however, in some cases
.Pq like when building a router ,
it might be wise not to install the compiler.
.It Pa etc\nv.ngz
This set installs the files in
.Pa /etc
as well as the
.Xr httpd 8
manual and the default .profile files.
It is never offered during an upgrade to not overwrite your changes.
.It Pa gnu\nv.ngz
Contains those parts of the base system that are under less free
licences, such as perl, sendmail, and lynx.
You can choose to not install this set, but your system will
not really be functional without.
.It Pa sym\nv.ngz
Debugging symbols for most libraries and executables except gcc and X11.
You almost never want to install this set.
.It Pa xbase\nv.ngz
Most of the files needed for XFree86\(rg, the graphical user interface.
.It Pa xetc\nv.ngz
Configuration files for XFree86\(rg, not offered during an upgrade either.
.El
.Pp
The installation of the sets is going to take a while.
After it has finished, you will be asked a final set of questions.
If you ever want to run the X Window System (the graphical user
interface), answer
.Ic yes
to the corresponding question.
Finally, the device nodes which reside in
.Pa /dev
are created by executing
.Xr MAKEDEV 8 ,
and an initial random seed will be generated and written to the
newly installed system.
.Pp
At the end of the installation, the installer asks you to reboot.
If you flagged the
.Mx
partition as bootable in the beginning, the computer will automatically
boot into
.Mx .
If you use a boot manager, you will have to configure it accordingly
to boot the partition
.Po
this is called a
.Qq chainloader
in LILO and GNU grub
.Pc .
The default
.Mx
MBR also contains a boot manager.
To boot the active partition, just press Return; select one of the
four primary partitions with the keys 0 to 3, or boot from a floppy
by pressing 5.
.Pp
Have fun with your new
.Mx
installation!
.\" --------------------------------------------------------------------
.Sh SEE ALSO
.Xr fdisk 8 ,
.Xr disklabel 8
.Pp
The MirOS homepage:
.Pa http://mirbsd.de/
.Pp
rawrite for Microsoft\(rg Windows\(rg:
.Pa http://uranus.it.swin.edu.au/~jn/linux/rawwrite.htm
.Sh AUTHORS
This manual page was written by
.An Benny Siegert Aq bsiegert@gmx.de .
For the names of the authors and all the copyright notices, see the file
.Pa /usr/share/doc/legal/1stREAD
on the installed system.
