src/usr.sbin/tcpdrop/tcpdrop.8
.\" $MirOS$
.\" $OpenBSD: tcpdrop.8,v 1.5 2004/05/24 13:57:31 jmc Exp $
.\"
.\" Copyright (c) 2004 Markus Friedl <markus@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate$
.Dt TCPDROP 8
.Os
.Sh NAME
.Nm tcpdrop
.Nd drop a TCP connection
.Sh SYNOPSIS
.Nm tcpdrop
.Ar laddr
.Ar lport
.Ar faddr
.Ar fport
.Nm
.Ar laddr Ns \&. Ns Ar lport
.Ar faddr Ns \&. Ns Ar fport
.Nm
.Ar laddr Ns \&: Ns Ar lport
.Ar faddr Ns \&: Ns Ar fport
.Sh DESCRIPTION
The
.Nm
command drops the TCP connection specified by the local address
.Ar laddr ,
port
.Ar lport
and the foreign address
.Ar faddr ,
port
.Ar fport .
Addresses and ports can be specified by name or numeric value.
.Sh EXAMPLES
If a connection to
.Xr httpd 8
is causing congestion on a network link, one can drop the TCP session
in charge:
.Bd -literal -offset indent
# fstat | egrep 'httpd.*internet.*\*(Lt--'
www      httpd      21307    3* internet stream tcp \e
	0xd1007ca8 192.168.5.41:80 \*(Lt-- 192.168.5.1:26747
.Ed
.Pp
The following command will drop the connection:
.Bd -literal -offset indent
# tcpdrop 192.168.5.41 80 192.168.5.1 26747
.Ed
.Pp
If
.Xr lynx 1
is hanging on a connection again (also works for IPv6)...
.Bd -literal -offset indent
$ netstat -anv | fgrep .80
tcp        0      0                                 \e
    192.168.0.225.25724    193.99.144.85.80         \e
    ESTABLISHED
.Ed
.Pp
\&... then this, easily copy/pasted, will drop the connection:
.Bd -literal -offset indent
$ sudo tcpdrop 192.168.0.225.25724    193.99.144.85.80
.Ed
.Pp
Do not forget the
.Fl v
option to
.Xr netstat 1
because otherwise, the IP address may be cut off in the middle.
.Sh SEE ALSO
.Xr fstat 1 ,
.Xr netstat 1
