src/usr.sbin/wssetfont/wssetfont.8
.\" $MirOS$
.\"
.\" Copyright (c) 2004
.\" 	Benjamin Lewis.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd February 28, 2004
.Dt WSFONTLOAD 8
.Os
.Sh NAME
.Nm wssetfont
.Nd Set the font for a wscons display device
.Sh SYNOPSIS
.Nm wssetfont
.Op Fl c Ar cfgdev
.Op Fl t Ar ttydev
.Op name | Fl s Ar slot
.Sh DESCRIPTION
The
.Nm wssetfont
utility set the specified console to use a font previously loaded with the
.Xr wsfontload 8
utility.
The font is specified either by
.Ar name
or by using the
.Fl s Ar slot
option.
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl c Ar cfgdev
Specify the control device of the wscons display to operate on.
Default is
.Pa /dev/ttyCcfg .
.It Fl t Ar ttydev
Specify the name of the tty console device to operate on.
Default is the current console, i.e. the terminal device
currently open on STDIN, as would be returned by
.Xr tty 1 .
.It Fl s Ar slot
Specify to use the font currently loaded in
.Ar slot .
.El
.Pp
If neither a
.Ar name
or the
.Fl s Ar slot
option are given, the built in font for the device will be used.
.Sh EXAMPLES
.Dl # wsfontload -N myfont -e iso /usr/share/misc/pcvt/vt220l.816
.Dl # wssetfont -t /dev/ttyC0 myfont
.Pp
Load a font from the pcvt directory, and set the first console to use
this font.
.Pp
.Dl # wssetfont
.Pp
Set the current console back to the default built in font.
.Sh SEE ALSO
.Xr wscons 4 ,
.Xr wsconscfg 8 ,
.Xr wsconsctl 8 ,
.Xr wsfontload 8
.Sh HISTORY
.Nm
appeared in
.Mx 8 .
.Sh BUGS
If two fonts are given the same name when loaded, and both are valid
for the current screen type, the first font will always be chosen,
even if the
.Fl s Ar slot
option is used.
.Pp
Some devices may support the use of multiple fonts; this utility does
not provide a method of setting more than one font for a given device.
