src/share/man/man8/afterboot.8
.\"	$MirOS: src/share/man/man8/afterboot.8,v 1.14 2012/01/15 03:33:41 tg Exp $
.\"	$OpenBSD: afterboot.8,v 1.110 2005/07/14 21:12:17 jmc Exp $
.\"
.\" Copyright (c) 1997 Marshall M. Midden
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\"
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by Marshall M. Midden.
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd $Mdocdate$
.Dt AFTERBOOT 8
\!\" Originally created by Marshall M. Midden -- 1997-10-20, m4@umn.edu
.Os
.Sh NAME
.Nm afterboot
.Nd things to check after the first complete boot
.Sh DESCRIPTION
.Ss Starting out
This document attempts to list items for the system administrator
to check and set up after the installation and first complete boot of the
system.
The idea is to create a list of items that can be checked off so that you have
a warm fuzzy feeling that something obvious has not been missed.
A basic knowledge of
.Ux
is assumed, otherwise type
.Pp
.Dl # help
.Pp
Complete instructions for correcting and fixing items is not provided.
There are manual pages and other methodologies available for doing that.
For example, to view the man page for the
.Xr ls 1
command, type:
.Pp
.Dl # man 1 ls
.Pp
Administrators will rapidly become more familiar with
.Mx BSD
if they get used to using the high quality manual pages.
.Pp
In order to browse a file, for example
.Pa /usr/share/doc/legal/1stREAD ,
which you \fBshould really\fR read, type:
.Pp
.Dl # less /usr/share/doc/legal/1stREAD
.Pp
Within
.Xr less 1 ,
type \&? for help and q to quit.
.Pp
Other important files to read include
.Pa /usr/share/doc/legal/LICENCE ,
which refers to most other files within the same directory.
You are obliged to read, understand and acknowledge the licences
outlined in these files to use this product.
.Ss Errata
By the time that you have installed your system, it is quite likely that
bugs in the release have been found.
Most significant and easily fixed problems will be reported at
the errata webpage at
.Pa http://mirbsd.de/
or its subpages.
The web page will mention if a problem is security related.
It is recommended that you check this page regularly.
.Ss Online help
Basic use of the
.Xr lynx 1
command required.
.Pp
To see current online manual pages, go to this page:
.Pa http://www.mirbsd.org/cman/
.Pp
For interactive help, see our mailing lists:
.Pa http://www.mirbsd.org/?mail
.Pp
There are several IRC channels to connect to:
.Pa http://www.mirbsd.org/?irc
.br
Please note there is no longer an IRC client in the default installation; use
.Pa net/sirc ,
.Pa net/bitchx ,
or
.Pa net/irssi .
.Ss Login
During installation, a user with which you can login has been created.
Use
.Xr sudo 8
to perform administrative tasks.
Logging in as
.Dq root
is no longer possible; this also affects single user mode
(which only works after you manually set a root password).
You can do so on the console, or over the network using
.Xr ssh 1 .
If you wish to log in as root over the network, edit the
.Pa /etc/ssh/sshd_config
file and set
.Cm PermitRootLogin
to
.Dq yes
first (see
.Xr sshd_config 5 ) ,
but this is totally insecure.
Also, root no longer has a home directory, so using it for
anything practical is not intended.
.Pp
If you want to use RSA Version 1 or DSA Version 2 keys with
.Xr sshd 8 ,
you must edit the
.Pa /etc/ssh/sshd_config
file first and generate the keys using
.Dl # /usr/bin/ssh-keygen \-q \-t rsa1 \-f /etc/ssh/ssh_host_key \-N \'\'
for RSA Version 1 (old), and
.Dl # /usr/bin/ssh-keygen \-q \-t dsa \-f /etc/ssh/ssh_host_dsa_key \-N \'\'
for DSA Version 2 (extremely slow).
These are however both totally insecure.
.Pp
Upon successful login on the console, you may see the message
.Dq Don't login as root, use su .
For security reasons, it is bad practice to log in as root during regular use
and maintenance of the system.
Instead, administrators are encouraged to add a
.Dq regular
user, add said user to the
.Dq wheel
group, then use the
.Xr su 1
and
.Xr sudo 8
commands when root privileges are required.
This process is described in more detail later.
.Ss Root password
This section only applies when you want to log in as root
.Pq which you should not do ,
or for single-user mode if you remove the word
.Ic secure
from the line for the
.Ic console
in
.Pa /etc/ttys .
Change the password for the root user.
(Note that throughout the documentation, the term
.Dq superuser
is a synonym for the root user.)
Choose a password that has numbers, digits, and special characters (not space)
as well as from the upper and lower case alphabet.
Do not choose any word in any language.
It is common for an intruder to use dictionary attacks.
Type the command
.Ic /usr/bin/passwd
to change it.
.Pp
It is a good idea to always specify the full path name for both the
.Xr passwd 1
and
.Xr su 1
commands as this inhibits the possibility of files placed in your execution
.Ev PATH
for most shells.
Furthermore, the superuser's
.Ev PATH
should never contain the current directory
.Pq Dq \&. .
.Ss Secure console
If you set a root password, it's a good idea to remove the word
.Ic secure
from the line starting with
.Ic console
in the
.Pa /etc/ttys
file.
Leaving the word
.Ic secure
there permits single-user boot and login without a password,
but if you remove it, you had better set a root password first
.Pq see above
because otherwise you will not be able to use single user mode at all,
even if you need it to rescue the system.
.Ss System date
Check the system date with the
.Xr date 1
command.
If needed, change the date, and/or change the symbolic link of
.Pa /etc/localtime
to the correct time zone in the
.Pa /usr/share/zoneinfo
directory.
.Pp
It is highly recommended to use
.Xr ntpd 8 ,
or at least
.Xr rdate 8 ,
to set the system clock against a NTP or time server.
In the default crontab, there is even an entry which does that
automatically after installation, using the
.Xr adjtime 2
system call, which is not suitable for setting the clock, only
adjusting it by a few milliseconds, but can be used in a runlevel
greater than 0 as well.
.Pp
Examples:
.Pp
Set the current date to January 27th, 1999 3:04pm:
.Dl # date 199901271504
.Pp
Set the time zone to Atlantic Standard Time:
.Dl # ln -fs /usr/share/zoneinfo/Canada/Atlantic /etc/localtime
.Ss Check hostname
Use the
.Ic hostname
command to verify that the name of your machine is correct.
See the man page for
.Xr hostname 1
if it needs to be changed.
You will also need to edit the
.Pa /etc/myname
file to have it stick around for the next reboot.
.Ss Verify network interface configuration
The first thing to do is an
.Ic ifconfig -a
to see if the network interfaces are properly configured.
Correct by editing
.Pa /etc/hostname. Ns Ar interface
(where
.Ar interface
is the interface name, e.g.,
.Dq le0 )
and then using
.Xr ifconfig 8
to manually configure it
if you do not wish to reboot.
Read the
.Xr hostname.if 5
man page for more information on the format of
.Pa /etc/hostname. Ns Ar interface
files.
The default routes are also set in these files; if you come from
.Ox
you will have to merge your
.Pa /etc/mygate
into a
.Pa /etc/hostname. Ns Ar interface
file - preferably with
.Ar interface
being the one on which the route is set.
The loopback interface will look something like:
.Bd -literal -offset indent
lo0: flags=8009<UP,LOOPBACK,MULTICAST> mtu 32972
	inet6 fe80::1%lo0 prefixlen 64 scopeid 0x3
	inet6 ::1 prefixlen 128
	inet 127.0.0.1 netmask 0xff000000
.Ed
.Pp
an Ethernet interface something like:
.Bd -literal -offset indent
le0: flags=9863<UP,BROADCAST,NOTRAILERS,RUNNING,SIMPLEX,MULTICAST>
	inet 192.168.4.52 netmask 0xffffff00 broadcast 192.168.4.255
	inet6 fe80::5ef0:f0f0%le0 prefixlen 64 scopeid 0x1
.Ed
.Pp
and a PPP interface something like:
.Bd -literal -offset indent
ppp0: flags=8051<UP,POINTOPOINT,RUNNING,MULTICAST>
        inet 203.3.131.108 --> 198.181.0.253 netmask 0xffff0000
.Ed
.Pp
See
.Xr netstart 8
for instructions on configuring multicast routing.
.Pp
See
.Xr dhcp 8
for instructions on configuring interfaces with DHCP.
.Ss Check routing tables
Issue a
.Ic netstat -rn
command.
The output will look something like:
.Bd -literal -offset indent
Routing tables

Internet:
Destination    Gateway           Flags  Refs     Use  Mtu  Interface
default        192.168.4.254     UGS      0 11098028    -  le0
127            127.0.0.1         UGRS     0        0    -  lo0
127.0.0.1      127.0.0.1         UH       3       24    -  lo0
192.168.4      link#1            UC       0        0    -  le0
192.168.4.52   8:0:20:73:b8:4a   UHL      1     6707    -  le0
192.168.4.254  0:60:3e:99:67:ea  UHL      1        0    -  le0

Internet6:
Destination        Gateway       Flags  Refs  Use     Mtu  Interface
::/96              ::1           UGRS     0     0   32972  lo0 =>
::1                ::1           UH       4     0   32972  lo0
::ffff:0.0.0.0/96  ::1           UGRS     0     0   32972  lo0
fc80::/10          ::1           UGRS     0     0   32972  lo0
fe80::/10          ::1           UGRS     0     0   32972  lo0
fe80::%le0/64      link#1        UC       0     0    1500  le0
fe80::%lo0/64      fe80::1%lo0   U        0     0   32972  lo0
ff01::/32          ::1           U        0     0   32972  lo0
ff02::%le0/32      link#1        UC       0     0    1500  le0
ff02::%lo0/32      fe80::1%lo0   UC       0     0   32972  lo0
.Ed
.Pp
The default gateway address is stored in the
.Xr hostname.if 5
file.
If you need to edit this file, a painless way to reconfigure the network
afterwards is
.Ic route flush
followed by a
.Ic sh -x /etc/netstart
command.
You may manually configure using a series of
.Ic route add
and
.Ic route delete
commands (see
.Xr route 8 ) .
If you run
.Xr dhclient 8
you will have to kill it by running
.Ic kill $(</var/run/dhclient.pid)
after you flush the routes.
.Pp
If you wish to route packets between interfaces, add one or both
of the following directives (depending on whether IPv4 or IPv6 routing
is required) to
.Pa /etc/sysctl.conf :
.Pp
.Dl net.inet.ip.forwarding=1
.Dl net.inet6.ip6.forwarding=1
.Pp
Packets are not forwarded by default, due to RFC requirements.
.Ss Check disk mounts
Check that the disks are mounted correctly by
comparing the
.Pa /etc/fstab
file against the output of the
.Xr mount 8
and
.Xr df 1
commands.
Example:
.Bd -literal -offset indent
# cat /etc/fstab
/dev/sd0a / ffs rw 1 1
/dev/sd0d /usr ffs rw,nodev 1 2
/dev/sd0e /var ffs rw,nodev,nosuid 1 3
/dev/sd0g /tmp ffs rw,nodev,nosuid 1 4
/dev/sd0h /home ffs rw,nodev,nosuid 1 5

# mount
/dev/sd0a on / type ffs (local)
/dev/sd0d on /usr type ffs (local, nodev)
/dev/sd0e on /var type ffs (local, nodev, nosuid)
/dev/sd0g on /tmp type ffs (local, nodev, nosuid)
/dev/sd0h on /home type ffs (local, nodev, nosuid)

# df
Filesystem  1024-blocks     Used    Avail Capacity  Mounted on
/dev/sd0a         22311    14589     6606    69%    /
/dev/sd0d        203399   150221    43008    78%    /usr
/dev/sd0e         10447      682     9242     7%    /var
/dev/sd0g         18823        2    17879     0%    /tmp
/dev/sd0h          7519     5255     1888    74%    /home

# pstat -s
Device      512-blocks     Used    Avail Capacity  Priority
swap_device     131072    84656    46416    65%    0
.Ed
.Pp
Edit
.Pa /etc/fstab
and use the
.Xr mount 8
and
.Xr umount 8
commands as appropriate.
Refer to the above example and
.Xr fstab 5
for information on the format of this file.
.Pp
You may wish to do NFS partitions now too, or you can do them later.
.Ss Check the running system
You can use
.Xr ps 1 ,
.Xr netstat 1 ,
and
.Xr fstat 1
to check on running processes, network connections, and opened files,
respectively.
.Sh CHANGING /etc FILES
The system should be usable now, but you may wish to do more customizing,
such as adding users, etc.
Many of the following sections may be skipped
if you are not using that package (for example, skip the
.Sx Sendmail
section if you won't be using Sendmail (not recommended)).
We suggest that you
.Ic cd /etc
and edit most of the files in that directory.
.Pp
Note that the
.Pa /etc/motd
file is modified by
.Pa /etc/rc
whenever the system is booted.
To keep any custom message intact, ensure that you leave two blank lines
at the top, or your message will be overwritten.
.Ss Add new users
Add users.
There is no
.Xr adduser 8
script.
You may use
.Xr vipw 8
to add users to the
.Pa /etc/passwd
file
and edit
.Pa /etc/group
by hand to add new groups.
You may also wish to edit
.Pa /etc/login.conf
and tune some of the limits documented in
.Xr login.conf 5 .
The manual page for
.Xr su 1
tells you to make sure to put people in
the
.Sq wheel
group if they need root access.
For example:
.Pp
.Dl wheel:*:0:root,myself
.Ss System command scripts
The
.Pa /etc/rc.*\&
scripts are invoked at boot time, after single user mode has exited,
and at shutdown.
The whole process is controlled, more or less, by the master script
.Pa /etc/rc .
This script should not be changed by administrators.
.Pp
.Pa /etc/rc
is in turn influenced by the configuration variables present in
.Pa /etc/rc.conf .
Again this script should not be changed by administrators:
site-specific changes should be made to
.Pq freshly created if necessary
.Pa /etc/rc.conf.local .
.Pp
Any commands which should be run before the system sets its
secure level should be made to
.Pa /etc/rc.securelevel ,
and commands to be run after the system sets its
secure level should be made to
.Pa /etc/rc.local .
Commands to be run before system shutdown should be set in
.Pa /etc/rc.shutdown .
.Pp
For more information about system startup/shutdown files, see
.Xr rc 8 ,
.Xr rc.conf 8 ,
.Xr securelevel 7 ,
and
.Xr rc.shutdown 8 .
.Pp
If you've installed X, you may want to turn on
.Xr xdm 1 ,
the X Display Manager.
To do this, change the value of
.Va xdm_flags
in
.Pa /etc/rc.conf.local .
.Ss Set keyboard type
Some architectures permit keyboard type control.
Use the
.Xr kbd 8
command to change the keyboard encoding.
.Ic kbd -l
will list all available encodings.
.Ic kbd xxx
will select the
.Ic xxx
encoding.
Store the encoding in
.Pa /etc/kbdtype
to make sure it is set automatically at boot time.
.Ss Printers
Edit
.Pa /etc/printcap
and
.Pa /etc/hosts.lpd
to get any printers set up.
Consult
.Xr lpd 8
and
.Xr printcap 5
if needed.
.Ss Mail aliases
Edit
.Pa /etc/mail/aliases
and set the three standard aliases to go to either a mailing list, or
the system administrator.
.Bd -literal -offset indent
# Well-known aliases -- these should be filled in!
root:		sysadm
manager:	root
dumper:		root
.Ed
.Pp
Run
.Xr newaliases 8
after changes.
.Ss Sendmail
.Mx
ships with a default
.Pa /etc/mail/localhost.cf
file that will work for simple installations; it was generated from
.Pa openbsd-localhost.mc
in
.Pa /usr/share/sendmail/cf .
Please see
.Pa /usr/share/sendmail/README
and
.Pa /usr/share/doc/smm/08.sendmailop/op.me
for information on generating your own sendmail configuration files.
For the default installation, sendmail is configured to only accept
connections from the local host and to not accept connections on
any external interfaces.
This makes it possible to send mail locally, but not receive mail from remote
servers, which is ideal if you have one central incoming mail machine and
several clients.
To cause sendmail to accept external network connections, modify the
.Va sendmail_flags
variable in
.Pa /etc/rc.conf.local
to use the
.Pa /etc/mail/sendmail.cf
file in accordance with the comments therein.
This file was generated from
.Pa openbsd-proto.mc .
.Pp
Note that sendmail now also listens on port 587 by default.
This is to implement the RFC 2476 message submission protocol.
You may disable this via the
.Ic no_default_msa
option in your sendmail .mc file.
See
.Pa /usr/share/sendmail/README
for more information.
The
.Pa /etc/mail/localhost.cf
file already has this disabled.
.Ss Name server (DNS)
If you are using a name server from MirPorts (djbdns or BIND 9),
check the
.Pa /etc/resolv.conf
file.
It may look something like:
.Bd -literal -offset indent
domain nts.umn.edu
nameserver 128.101.101.101
nameserver 134.84.84.84
search nts.umn.edu. umn.edu.
lookup file bind
.Ed
.Pp
If using a caching name server, add the line "nameserver 127.0.0.1" first.
To get a local BIND instance to run,
you will need to set
.Va named_flags
in
.Pa /etc/rc.conf.local .
In this case, make sure that
.Xr named 8
is running
(otherwise there are long waits for resolver timeouts).
.Ss BOOTP server
If this is a BOOTP server, edit
.Pa /etc/dhcpd.conf
as needed.
.Xr dhcpd 8
will have to be turned on in
.Xr rc.conf.local 8 .
.Ss Clock synchronisation
In order to make sure the system clock is synchronised
to that of a publicly accessible NTP server,
make sure that
.Pa /etc/rc.conf.local
contains the following:
.Pp
.Dl ntpd_flags=\&"\&"
.Pp
See
.Xr ntpd 8 ,
.Xr rdate 8 ,
and
.Xr timed 8
for more information on setting the system's date.
.Ss Concatenated disks (ccd)
If you are using
.Xr ccd 4
concatenated disks, edit
.Pa /etc/ccd.conf .
Use the
.Ic ccdconfig -U
command to unload and the
.Ic ccdconfig -C
command to create tables internal to the kernel for the concatenated disks.
You then
.Xr mount 8 ,
.Xr umount 8 ,
and edit
.Pa /etc/fstab
as needed.
.Ss DHCP server
If this is a
DHCP
server, edit
.Pa /etc/dhcpd.conf
and
.Pa /etc/dhcpd.interfaces
as needed.
You will have to make sure
.Pa /etc/rc.conf.local
has:
.Pp
.Dl dhcpd_flags=\&"\&"
.Pp
or run
.Xr dhcpd 8
manually.
.Ss HP remote boot server
Edit
.Pa /etc/rbootd.conf
if needed for remote booting.
If you do not have HP computers doing remote booting, do not enable this.
.Ss Kerberos
If you are going to use
.Xr kerberos 8
for authentication, and you already have a
Kerberos
master, change directory to
.Pa /etc/kerberosV
and configure.
Remember to get a
.Pa srvtab
from the master so that the remote commands work.
.Ss NFS server
If this is an NFS server
make sure
.Pa /etc/rc.conf.local
has:
.Pp
.Dl nfs_server=YES
.Pp
Edit
.Pa /etc/exports
and get it correct.
It is probably easier to reboot than to get the daemons running manually,
but you can get the order correct by looking at
.Pa /etc/rc .
.Ss RPC-based network services
Several services depend on the RPC portmapper,
.Xr portmap 8 ,
being running for proper operation.
This includes NFS exports, among other services.
To get the RPC portmapper to start automatically on boot,
you will need to have this line in
.Pa /etc/rc.conf.local :
.Pp
.Dl portmap=YES
.Ss Daily, weekly, monthly scripts
Look at and possibly edit the
.Pa /etc/daily , /etc/weekly ,
and
.Pa /etc/monthly
scripts.
Your site specific things should go into
.Pa /etc/daily.local , /etc/weekly.local ,
and
.Pa /etc/monthly.local .
.Pp
These scripts have been limited so as to keep the system running without
filling up disk space from normal running processes and database updates.
(You probably do not need to understand them.)
.Pp
The
.Pa /altroot
filesystem can optionally be used to provide a backup of the
root filesystem on a daily basis.
To take advantage of this, you must have an entry in
.Pa /etc/fstab
with
.Dq xx
for the mount option:
.Pp
.Dl /dev/wd0j /altroot ffs xx 0 0
.Pp
and you must add a line to root's
.Xr crontab 5 :
.Pp
.Dl ROOTBACKUP=1
.Pp
so that the
.Pa /etc/daily
script will make a daily backup of the root filesystem.
.Ss Tighten up security
You might wish to tighten up security more by editing
.Pa /etc/fbtab
as when installing X.
In
.Pa /etc/inetd.conf
comment out any extra entries you do not need,
and only add things that are really needed.
.Ss Other files in /etc
Look at the other files in
.Pa /etc
and edit them as needed.
(Do not edit files ending in
.Pa .db
\(em like
.Pa pwd.db , spwd.db ,
nor
.Pa localtime ,
nor
.Pa rmt ,
nor any directories.)
.Pp
Many files \- for example,
.Pa /etc/mk.conf ,
.Pa /etc/profile ,
.Pa /etc/rc.conf ,
.Pa /etc/changelist ,
and others \- provide the ability to have them unchanged
and place the changes into the file with \fB.local\fR added.
Example:
.Dl # echo 'rdate_flags="-n ntp0.nl.net"' >>/etc/rc.conf.local
.Pp
It is recommended to use
.Xr rcs 1
for versioning files in
.Pa /etc ,
especially those not in any changelist.
.Ss Crontab (background running processes)
Check what is running by typing
.Ic crontab -l
as root
and see if anything unexpected is present.
Do you need anything else?
Do you wish to change things?
For example, if you do not
like root getting standard output of the daily scripts, and want only
the security scripts that are mailed internally, you can type
.Ic crontab -e
and change some of the lines to read:
.Bd -literal -offset indent
30  1  *  *  *   /bin/mksh /etc/daily >/var/log/daily.out 2>&1
30  3  *  *  6   /bin/mksh /etc/weekly >/var/log/weekly.out 2>&1
30  5  1  *  *   /bin/mksh /etc/monthly >/var/log/monthly.out 2>&1
.Ed
.Pp
See
.Xr crontab 5 .
.Ss Next day cleanup
After the first night's security run, change ownerships and permissions
on files, directories, and devices; root should have received mail
with subject: "<hostname> daily insecurity output.".
This mail contains
a set of security recommendations, presented as a list looking like this:
.Bd -literal -offset indent
var/mail:
        permissions (0755, 0775)
etc/daily:
        user (0, 3)
.Ed
.Pp
The best bet is to follow the advice in that list.
The recommended setting is the first item in parentheses, while
the current setting is the second one.
This list is generated by
.Xr mtree 8
using
.Pa /etc/mtree/special .
Use
.Xr chmod 1 ,
.Xr chgrp 1 ,
and
.Xr chown 8
as needed.
.Ss Packages
Install your own packages.
See
.Xr ports 7
and
.Xr packages 7
for more details.
.Pp
Copy vendor binaries and install them.
You will need to install any shared libraries, etc.
(Hint:
.Ic man -k compat
to find out how to install and use compatibility mode.)
.Pp
There is also other third-party software that is available
in source form only, either because it has not been ported to
.Mx
yet, or because licensing restrictions make binary redistribution
impossible.
Sometimes checking the mailing lists for
past problems that people have encountered will result in a fix posted.
.Sh COMPILING A KERNEL
Note:
The standard
.Mx
kernel configuration (GENERIC) is suitable for most purposes.
Use of an alternative kernel configuration is not recommended.
.Pp
First, review the system message buffer using the
.Xr dmesg 8
command to find out information on your system's devices as probed by the
kernel at boot.
In particular, note which devices were not configured.
This information will prove useful when editing kernel configuration files.
.Pp
To compile a kernel inside a writable source tree, do the following:
.Bd -literal -offset indent
# cd /usr/src/sys/arch/somearch/conf
# vi SOMEFILE  (to make any changes)
# config SOMEFILE
# cd ../compile/SOMEFILE
# make
.Ed
.Pp
where
.Ar somearch
is the architecture (e.g. i386), and
.Ar SOMEFILE
should be a name indicative of a particular configuration
(often that of the hostname).
You can also do a
.Ic make depend
so that you will have dependencies there the next time you do a compile.
.Pp
If you are building your kernel again, before you do a
.Ic make
you should do a
.Ic make depend
after making changes (including updates or patches) to your kernel source,
or a
.Ic make clean
after making changes to your kernel options.
.Pp
After either of these two methods, you can place the new kernel (called
.Pa bsd )
in
.Pa /
(i.e.\&
.Pa /bsd )
and the system will boot it next time.
Most people save their backup kernels as
.Pa /bsd.1 ,
.Pa /bsd.2 ,
etc.
.Pp
It is not always necessary to recompile the kernel if only
configuration changes are required.
With
.Xr config 8 ,
you can change the device configuration in the kernel file directly:
.Bd -literal -offset indent
# config -e -o bsd.new /bsd
OpenBSD 2.7-beta (GENERIC.rz0) #0: Mon Oct  4 03:57:22 MEST 1999
    root@winona:/usr/src/sys/arch/pmax/compile/GENERIC.rz0
Enter 'help' for information
ukc>
.Ed
.Pp
Additionally, you can permanently save the changes made with UKC during
boot time in the kernel image.
.Sh SEE ALSO
.Xr aliases 5 ,
.Xr bootpd 8 ,
.Xr bootptab 5 ,
.Xr ccd 4 ,
.Xr ccdconfig 8 ,
.Xr chgrp 1 ,
.Xr chmod 1 ,
.Xr chown 8 ,
.Xr config 8 ,
.Xr crontab 1 ,
.Xr crontab 5 ,
.Xr date 1 ,
.Xr df 1 ,
.Xr dhclient 8 ,
.Xr dhcp 8 ,
.Xr dhcpd 8 ,
.Xr dmesg 8 ,
.Xr fstat 1 ,
.Xr hostname 1 ,
.Xr ls 1 ,
.Xr make 1 ,
.Xr man 1 ,
.Xr netstat 1 ,
.Xr passwd 1 ,
.Xr pkg_add 1 ,
.Xr ps 1 ,
.Xr ssh 1 ,
.Xr su 1 ,
.Xr xdm 1 ,
.Xr ccd 4 ,
.Xr aliases 5 ,
.Xr crontab 5 ,
.Xr dhcpd.conf 5 ,
.Xr exports 5 ,
.Xr fbtab 5 ,
.Xr fstab 5 ,
.Xr ftpd 8 ,
.Xr group 5 ,
.Xr hostname 1 ,
.Xr hostname 7 ,
.Xr hostname.if 5 ,
.Xr login.conf 5 ,
.Xr passwd 5 ,
.Xr ttys 5 ,
.Xr printcap 5 ,
.Xr resolv.conf 5 ,
.Xr ssh_config 5 ,
.Xr sysctl.conf 5 ,
.Xr hier 7 ,
.Xr hostname 7 ,
.Xr packages 7 ,
.Xr ports 7 ,
.Xr ccdconfig 8 ,
.Xr chown 8 ,
.Xr config 8 ,
.Xr dhclient 8 ,
.Xr dhcp 8 ,
.Xr dhcpd 8 ,
.Xr dmesg 8 ,
.Xr ftpd 8 ,
.Xr ifconfig 8 ,
.Xr inetd 8 ,
.Xr kbd 8 ,
.Xr lpd 8 ,
.Xr ls 1 ,
.Xr make 1 ,
.Xr man 1 ,
.Xr mount 8 ,
.Xr mtree 8 ,
.Xr netstart 8 ,
.Xr netstat 1 ,
.Xr newaliases 8 ,
.Xr ntpd 8 ,
.Xr portmap 8 ,
.Xr ports 7 ,
.Xr printcap 5 ,
.Xr rbootd 8 ,
.Xr rc 8 ,
.Xr rdate 8 ,
.Xr rmt 8 ,
.Xr route 8 ,
.Xr sendmail 8 ,
.Xr sudo 8 ,
.Xr sysctl 8 ,
.Xr timed 8 ,
.Xr umount 8 ,
.Xr vipw 8 ,
.Xr xdm 1
.Sh HISTORY
This document first appeared in
.Ox 2.2 .
.Sh BUGS
This document is totally out of date.
