src/bin/hostname/hostname.1
.\"	$MirOS$
.\"	$OpenBSD: hostname.1,v 1.18 2003/12/03 14:06:08 jmc Exp $
.\"	$NetBSD: hostname.1,v 1.11 1995/09/07 06:28:39 jtc Exp $
.\"
.\" Copyright (c) 1983, 1988, 1990, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	@(#)hostname.1	8.2 (Berkeley) 4/28/95
.\"
.Dd $Mdocdate$
.Dt HOSTNAME 1
.Os
.Sh NAME
.Nm hostname
.Nd set or print name of current host system
.Sh SYNOPSIS
.Nm hostname
.Op Fl fs
.Op Ar name-of-host
.Sh DESCRIPTION
The
.Nm
utility prints the name of the current host.
The superuser can set the host name by supplying a
.Pa /etc/myname
file.
This is used at system boot time by
.Xr netstart 8
to initialise the hostname.
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl f
Returns what the DNS resolver thinks the hostname canonicalises to.
This is usually the
.Dq official host name
of the first line in
.Pa /etc/hosts
whose official host name or alias matches the name of the current host,
but can also be retrieved from DNS.
.It Fl s
Trims off any domain information from the printed
name.
.El
.Sh FILES
.Bl -tag -width XetcXmyname -compact
.It Pa /etc/hosts
The host name database.
.It Pa /etc/myname
Configuration file containing the fully qualified host name
.Pq FQDN ,
to be set at system boot time.
.El
.Sh SEE ALSO
.Xr domainname 1 ,
.Xr getaddrinfo 3 ,
.Xr gethostname 3 ,
.Xr sethostname 3 ,
.Xr hosts 5 ,
.Xr myname 5 ,
.Xr hostname 7 ,
.Xr netstart 8
.Sh HISTORY
The
.Nm
utility appeared in
.Bx 4.2 .
The
.Fl f
option appeared in
.Mx 11 ,
inspired by the
.Tn GNU
version of
.Nm .
