src/sys/arch/i386/stand/installboot/installboot.8
.\"	$MirOS: src/sys/arch/i386/stand/installboot/installboot.8,v 1.20 2009/11/22 14:53:41 tg Exp $
.\"	$OpenBSD: installboot.8,v 1.28 2007/05/31 19:20:03 jmc Exp $
.\"
.\" Copyright (c) 1997 Michael Shalayeff
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"
.Dd $Mdocdate: November 22 2009 $
.Dt INSTALLBOOT 8 i386
.Os
.Sh NAME
.Nm installboot
.Nd installs a bootstrap on an FFS disk or partition
.Sh SYNOPSIS
.Nm installboot
.Op Fl Anv
.Oo Fl s Ar sectors-per-track Oc
.Oo Fl h Ar tracks-per-cyl Oc
.Op Fl P Ar partition-type
.Ar boot
.Ar bootxx
.Ar disk
.Sh DESCRIPTION
.Nm installboot
is used to install a
.Dq first-stage
boot program into the boot area
of an FFS disk partition, and initialize the table of block numbers the
PBR programme uses to load the second-stage boot program.
.Pp
The options are as follows:
.Bl -tag -width flag_opt
.It Fl A
Tell
.Nm bootxx
to use automatic geometry detection.
.It Fl n
Do not actually write anything on the disk.
.It Fl v
Be verbose, printing out the LBA addresses that are to be stored in
.Ar bootxx
along with lots of other information.
.It Fl s Ar sectors-per-track
Used to specify the sectors-per-track value if the drive has
sector translation activated, and
.Nm
is unable to determine the translated geometry.
If not specified, this defaults to d_nsectors from the disklabel.
If not specified, this defaults to the value retrieved from the BIOS
at boot time, available via
.Xr sysctl 8 .
If not available, automatic geometry detection is used.
Valid are values from 1 to 63, inclusive.
.It Fl h Ar tracks-per-cyl
Used to specify the tracks-per-cylinder value if the drive has
sector translation activated, and
.Nm
is unable to determine the translated geometry.
If not specified, this defaults to d_ntracks from the disklabel.
If not specified, this defaults to the value retrieved from the BIOS
at boot time, available via
.Xr sysctl 8 .
If not available, automatic geometry detection is used.
Valid are values from 1 to 256, inclusive.
.It Fl P Ar partition-type
Use the
.Ar partition-type
value in decimal (on
.Mx
also sedecimal or octal values are allowed, provided
they are prefixed with 0x or 0, respectively) as user-specified
partition type to search before the standard 0x27 and the fallback
0xA6, 0xA9 and 0xA5 types.
.El
.Pp
The arguments are:
.Bl -tag -width biosboot
.It Ar boot
The name of the second-stage boot program in the mounted filesystem
where the first-stage boot program is to be installed.
This should be a full pathname.
.It Ar bootxx
The name of the prototype file for the first stage boot program,
usually
.Pa /usr/mdec/bootxx .
.It Ar disk
The name of the disk containing the partition in which the second-stage
boot program resides and the first-stage boot program is to be installed.
This can either be specified in short form (i.e.,
.Sq sd0
or
.Sq wd0 ) ,
or as the explicit raw device node, such as
.Pa /dev/rsd0c
or
.Pa /dev/rwd0c .
.Pp
Note that you must be in single-user mode or have your kernel in
insecure mode (see the
.Xr sysctl 8
.Va kern.securelevel
variable or
.Pa /etc/rc.securelevel )
to enable access to the raw partition of a mounted disk.
.Pp
The
.Sq c
partition is always used to represent the
.Dq entire
disk on i386.
.El
.Sh EXAMPLES
The typical use is
.Pp
.Dl # cp /usr/mdec/boot /boot
.Dl # /usr/mdec/installboot -v -n /boot /usr/mdec/bootxx wd0
.Pp
And if the information supplied looks right, run the above without the
.Fl n
flag.
If you are upgrading an old system, you may need to preface
the above steps with some more steps... and do the following:
.Pp
.Dl boot the floppy.fs filesystem floppy
.Dl # fsck /dev/rsd0a
.Dl # mount /dev/sd0a /mnt
.Dl # cp /usr/mdec/boot /mnt/boot
.Dl # /usr/mdec/installboot -v /mnt/boot /usr/mdec/bootxx sd0
.Pp
If you need to find the BIOS geometry of the disk for
.Fl s
and
.Fl h
you can use the boot block command:
.Pp
.Dl boot> machine diskinfo
.Pp
Make a CD-ROM bootable for i386 (both as CD and as HD/CF/USB):
.Pp
.Bd -literal -offset ident
getextent_cd9660 -f cdrom10.iso boot \*(Ba \e
    mksh /usr/mdec/bootxx.sh -S 2 \*(Ba \e
    dd of=cdrom10.iso conv=notrunc
getextent_cd9660 -f cdrom10.iso boot \*(Ba \e
    mksh /usr/mdec/bootxx.sh -B 11 \*(Ba \e
    dd of=cdrom10.iso conv=notrunc bs=2048 \e
    seek=$(getextent_cd9660 -f cdrom10.iso -b '$BootImage$')
.Ed
.Sh SEE ALSO
.Xr boot 8 ,
.Xr disklabel 8 ,
.Xr fdisk 8 ,
.Xr init 8
.Sh HISTORY
The
.Fl A
option is supported by
.Nm bootxx
0AA8 and up.
.Sh BUGS
The disklabel
.Va d_type
field must be set to a value of
.Dq 4.2FFS .
.Pp
You cannot run
.Nm installboot
for a drive/partition other than the one you want the
.Pa /boot
to be loaded from.
