src/share/man/man4/man4.i386/powernowhack.4
.\" $MirOS: src/share/man/man4/man4.i386/powernowhack.4,v 1.1 2005/05/04 18:12:37 tg Exp $
.\"-
.\" Copyright (c) 2005
.\"	Thorsten "mirabile" Glaser <tg@66h.42h.de>
.\"
.\" Licensee is hereby permitted to deal in this work without restric-
.\" tion, including unlimited rights to use, publicly perform, modify,
.\" merge, distribute, sell, give away or sublicence, provided all co-
.\" pyright notices above, these terms and the disclaimer are retained
.\" in all redistributions or reproduced in accompanying documentation
.\" or other materials provided with binary redistributions.
.\"
.\" All advertising materials mentioning features or use of this soft-
.\" ware must display the following acknowledgement:
.\"	This product includes material provided by Thorsten Glaser.
.\"
.\" Licensor offers the work "AS IS" and WITHOUT WARRANTY of any kind,
.\" express, or implied, to the maximum extent permitted by applicable
.\" law, without malicious intent or gross negligence; in no event may
.\" licensor, an author or contributor be held liable for any indirect
.\" or other damage, or direct damage except proven a consequence of a
.\" direct error of said person and intended use of this work, loss or
.\" other issues arising in any way out of its use, even if advised of
.\" the possibility of such damage or existence of a nontrivial bug.
.\"-
.Dd May 4, 2005
.Dt POWERNOWHACK 4 i386
.Os
.Sh NAME
.Nm powernowhack
.Nd a pseudo-device for the AMD K7 PowerNow extension
.Sh SYNOPSIS
.Cd "powernowhack0 at mainbus0 flags 0x0000"
.Sh DESCRIPTION
.Mx
provides support for the PowerNow function of recent AMD K7
processors in order to save power or reduce heat.
This is the kernel driver for setting the CPU speed via
.Xr sysctl 8
using the
.Dv hw.setperf
knob and reporting the result using the
.Dv hw.cpuspeed
control.
.Pp
Flags is a bit mask which specifies how the driver operates.
.Bl -tag -width 0x0001
.It 0x8000
Override BIOS function.
.Pp
Do not look for a PST whose signature matches the CPUID.
Instead, only use the specified PST.
.It 0x4000
Verbose operation.
.Pp
Print a list of all PSTs shown even if we find a PST matching
the CPUID or the user has disabled the functionality by
selecting PST 0xFFF.
.It 0x0nnn
Select PST nnn.
.Pp
.Em nnn
is a hexadecimal value (three nibbles) specifying the number of
the PST to use.
PSTs are numbered linearily, starting from 001.
.Pp
If
.Em nnn
is 000 (default), additional output (the CPUID on which no
signature matches) is shown and PST #001 is used.
.Pp
If
.Em nnn
is FFF, the PowerNow function is disabled if no PST matching
the CPUID is found or flag 0x8000 is also specified.
.El
.Sh EXAMPLES
.Bl -tag -width 0x0001
.It 0x0000
Default. Look for a matching PST, use first and
list PSTs if none found.
.It 0x0FFF
Look for a matching PST, disable K7PN if none found.
.It 0x4FFF
List PSTs, then look for a matching PST and disable
K7PN is none found.
.It 0x8002
Do not bother looking for a matching PST.
Use the second PST.
.It 0xC002
Like 0x8002, but list all PSTs first.
.El
.Sh SEE ALSO
.Xr apm 4 ,
.Xr intro 4 ,
.Xr sysctl 3 ,
.Xr sysctl 8
.Sh HISTORY
The
.Nm
driver
appeared in
.Mx 8
and is based upon a third-party patch for
.Nx
which has not yet made it into an official tree.
.Sh AUTHORS
.Nm
originated as a patch by
.An Martin Vegiard Aq deadbug@gmail.com ,
was integrated into
.Ox
by
.An Ted Unangst Aq tedu@openbsd.org
and turned into a driver for
.Mx
by
.An Thorsten Glaser Aq tg@mirbsd.org .
.Sh CAVEATS
Using a mismatching PST may damage your CPU or induce
fire in your computer.
