src/usr.bin/wtf/wtf.1
.\"	$MirOS: src/usr.bin/wtf/wtf.1,v 1.2 2005/03/13 18:34:07 tg Exp $
.\"	$NetBSD: wtf.6,v 1.4 2001/04/02 22:42:40 wiz Exp $
.\"
.\" Public Domain
.\"
.Dd November 25, 2006
.Dt WTF 1
.Os
.Sh NAME
.Nm wtf
.Nd translates acronyms for you
.Sh SYNOPSIS
.Nm
.Op is \&| ist
.Ar acronym Ar ...
.Sh DESCRIPTION
The
.Nm
utility displays the expansion of the acronyms
specified on the command line.
If the acronym is unknown,
.Nm
will check to see if the acronym is known by the
.Xr whatis 1
command.
If the acronym is still not found, the "dict" (online
dictionary client) is tried if it exists.
.Pp
If
.Dq is
is specified on the command line, it will be ignored,
allowing the fairly natural
.Sy wtf\ is\ WTF
and, for German users,
.Sy wtf\ ist\ Windows
usage.
.Sh ENVIRONMENT
.Bl -tag -width ACRONYMDB
.It Ev ACRONYMDB
The default acronym database may be overridden by setting the
environment variable
.Ev ACRONYMDB
to the name of a file in the proper format (acronym[tab]meaning).
.El
.Sh FILES
.Bl -tag -width /usr/share/misc/acronyms -compact
.It Pa /usr/share/misc/acronyms
default acronym database.
.It Pa /usr/bin/dict
default search path for dictionary client
.It Pa /usr/local/bin/dict
standard search path for dictionary client
.It Pa /usr/mpkg/bin/dict
extended search path for dictionary client
.El
.Sh SEE ALSO
.Xr whatis 1
.Sh HISTORY
.Nm
first appeared in
.Nx 1.5 .
It then was ported to
.Mx 0 ,
actually being the very reason for MirOS to exist.
